[
    {
        "title": "Nestle to divest two factories in Germany, citing rising costs",
        "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_8af79b99-094e-4ad7-893c-3c078cf28593",
        "content": "yahoo guce guce Oops, something went wrong Please try again later",
        "topics": [
            "yahoo guce",
            "guce oops",
            "guce guce",
            "guce",
            "oops went"
        ]
    },
    {
        "title": "Nestle recalls frozen meals. Here's what to avoid",
        "url": "https://qz.com/nestle-lean-cuisine-recall-wood-1851771267",
        "content": "Nestle recalls Lean Cuisine, Stouffer's frozen dinners Elon Musk urges Tesla staffers to 'hang onto your stock' even though it has fallen 50% CCShare SubtitlesOffEnglishShare this VideoFacebookTwitterEmailRedditLinkview videoElon Musk urges Tesla staffers to 'hang onto your stock' even though it has fallen 50%Nestle recalls frozen meals. Here's what to avoidHomeLatestBusiness NewsMoney & MarketsTech & InnovationA.I.LifestyleLeadership✉️ Emails🎧 PodcastsAboutEditionsEspañolDeutschFrançaisExplore our other sitesAdvertisingPrivacyJobsTerms of Use© 2025 G/O MediaFoodNestle recalls frozen meals. Here's what to avoidThe latest recall comes after a \"wood-like substance\" was found in frozen dinnersByKevin WilliamsPublishedThursday 1:48PMWe may earn a commission from links on this page.Start SlideshowStart SlideshowIllustration: NestleAfter reports surfaced of a choking incident involving one of its frozen meals, Nestle issued a voluntary recall and said it detected a “wood-like” substance in some of its products. AdvertisementNestle didn’t disclose the scope of the recall — beyond describing it as “isolated to a limited quantity of batches” in a prepared statement. The company added that the Food and Drug Administration and the Department of Agriculture are involved in the matter.When seeking a little extra fiber, wood chips with your shrimp stir-fry probably aren’t top of mind. So, how does this happen?“Foreign objects, such as the wood-like material that has been found recently in some of Nestle’s frozen meal options, can find its way into food during the manufacturing or packaging stages,” said Jason Reese, co-founder and attorney at Wagner Reese, a firm which specializes in food injury and illness.He added, “Failure to follow proper safety protocols that include routine inspections of the equipment used in the process can result in contamination. From a legal perspective, if a company isn’t performing these checks and balances, this negligence could be considered product liability,” Reese told Quartz. Read on to see which products are on Nestle’s list.AdvertisementPrevious SlideNext SlideList slidesLean Cuisine Butternut Squash RavioliList slidesLean Cuisine Butternut Squash RavioliPhoto: Lean Cuisine (Getty Images) If you have this meal in your freezer and it has any of the codes below, toss it or take it back to the store for a refund.4261595912 - OCT20254283595912 - NOV20254356595912 - JAN20265018595912 - FEB20265038595912 - MAR2026 Julie Chapon, an expert in food safety and technology, told Quartz that the “presence of wood-like material in Nestle’s frozen dinners highlights a common issue in food manufacturing: foreign object contamination.” Chapon, the cofounder and CEO of Yuka — which makes a food and cosmetics scanning app — added that contamination can occur due to equipment malfunction or improper cleaning during the production process.Advertisement“Materials like wood, plastic, or metal can break off from machinery and inadvertently mix with food products,” Chapon said.AdvertisementPrevious SlideNext SlideList slidesLean Cuisine Spinach Artichoke RavioliList slidesLean Cuisine Spinach Artichoke RavioliPhoto: Lean CuisineThe following batches of these dinners have been recalled: 4311595912 - DEC20255002595912 - FEB20265037595912 - MAR20265064595912 - APR2026Chapon told Quartz that food recalls are on the rise for a variety of reasons. “ This trend is partly driven by stricter regulations and advancements in detection technology, which allow for more precise identification of contaminants,” Chapon said, adding that consumer expectations for safety and transparency have led companies to be more proactive in issuing recalls. AdvertisementPrevious SlideNext SlideList slidesLean Cuisine Lemon Garlic Shrimp Stir FryList slidesLean Cuisine Lemon Garlic Shrimp Stir FryPhoto: Lean CuisineOnly one batch of this dish has been impacted. If you have the following batch code, it is eligible for a refund and you should not consume the product: 4214595511 - SEPT2025AdvertisementPrevious SlideNext SlideList slidesSTOUFFER’S Party Size Chicken Lasagna (96oz)List slidesSTOUFFER’S Party Size Chicken Lasagna (96oz)Photo: StouffersPlanning to serve chicken lasagna at your party? Think again if you have these batches in your freezer:4262595915 - OCT20254351595915 - JAN20265051595915 - MAR20265052595915 - MAR2026 AdvertisementList slidesList slidesPreviousStart overWe may earn a commission from links on this page.",
        "topics": [
            "dinners recalled",
            "food recalls",
            "nestle frozen",
            "meal freezer",
            "frozen meals"
        ]
    },
    {
        "title": "Expert warns Walmart-popular frozen meals are being recalled by Nestle. Then she reveals they’re these Stouffer’s, Lean Cuisines",
        "url": "https://www.dailydot.com/news/walmart-nestle-lean-cuisine-stouffers-recall/",
        "content": "What Stouffer's, Lean Cuisine Frozens Is Nestle Recalling? What Stouffer's, Lean Cuisine Frozens Is Nestle Recalling? Skip to content Trending Tech Politics Culture Memes Labor Hacks About About Us Contact Jobs Terms Of Use Privacy Policy Trending Tech Politics Culture Memes Labor Hacks About About Us Contact Jobs Terms Of Use Privacy Policy Newsletter ‘This is important’: Doctor shares whether you should keep washing machine door closed or open ‘If I’m spending 1,000+ on a phone I want my bag’: Former Apple Store worker exposes how these rules force them to deny you perks ‘This is actually genius for some folks’: O’Reilly’s customer shocked when he discovers the store sells body wash. Then he learns the reason why ‘So we looked at Lowe’s and Home Depot’: Man nearly purchases new dryer. Then he realizes you can buy one at Costco for $530—it includes all this ‘I’m glad I can have it this way’: Fitness expert says this Wendy’s ‘secret menu hack’ can help you lose weight. How fast does it work? ‘I’m not going to be greedy’: Walmart shopper reaches for shrimp and snow crab seafood boil. Then she reveals the price tag ‘Where are y’all finding cars under $3K?’: Woman buys 2011 Toyota Camry LE for $1,500. Then she realizes it has hidden benefits ‘Let this be a warning’: Woman gets the Keaton Oaks haircut. Then she reveals what you have to know before considering it ‘This lady has some nerve’: Woman enters Aldi checkout aisle when a fellow customer asks for a surprising favor. Would you do it? ‘Someone messed up’: Costco shopper reaches for double-chocolate chunk cookies. Then he takes a closer look at the label ‘Girl even my dupe doesn’t tarnish’: Woman splurges on 18K gold Van Cleef bracelet. It starts tarnishing 2 months in ‘Something has happened in the last year or so’: Woman buys Knorr pasta. Then she demands answers when it doesn’t cook right Advertisement Trending Expert warns Walmart-popular frozen meals are being recalled by Nestle. Then she reveals they’re these Stouffer’s, Lean Cuisines ‘These products were distributed at major retailers…’ Ford Sanders Posted on March 19 2025 4:35 pm CDT @pjresponds/TikTok Ever enjoy a Lean Cuisine or a Stouffers meal for a quick and easy dinner? Well, think twice. On Monday, Nestle announced some of its meals from August 2024 – March 2025 may be contaminated with a wood-like material inside of them. Featured Video Which Stouffer’s, Lean Cuisine frozens are being recalled?“This recall is isolated to a limited quantity of batches of the following items: Lean Cuisine® Butternut Squash Ravioli, Lean Cuisine® Spinach Artichoke Ravioli, Lean Cuisine® Lemon Garlic Shrimp Stir Fry, and STOUFFER’S® Party Size Chicken Lasagna that were produced between August 2024-March 2025. These products were distributed at major retailers in the U.S. between September 2024-March 2025. This recall does not involve any other Lean Cuisine® or STOUFFER’S® products,” said Nestle representatives on their website.The company also says they are responding and taking care of one choking incident that has occurred due to this and this is why they are initiating the voluntary recall. Advertisement Some users took to TikTok to share the news. Journalist PJ Randhawa with NBC Chicago says in a video, “If you have one of these in your freezer, the company says don’t eat it. Take it back to the place you bought it from and you can get a full refund.”The internet reacts to Nestle recallTikTok User Orson Wails joked in the comments, “Nestle? I’m shocked.” poking fun at the company which has had issues in the past. The company recalled 440,500 Starbucks mugs due to burn and cut risks last March. In August of 2023 the company also had to recall two batches of its Toll House Chocolate Chip Cookie Dough “Break and Bake” bar after customers reported wood chips in them.Nestle says they are actively investigating the source of the wood-like material. And although they have had issues in the past with wood chips being in their products, the company’s reps said in a statement, “We are confident that this is an isolated issue, and we have taken action to address it. We are working with the U.S. Food & Drug Administration (FDA) and the U.S. Department of Agriculture (USDA) on this recall and will cooperate with them fully.” Advertisement The Daily Dot reached out to both Nestle as well as Walmart for comment on this recall. @hiddenknowledge7 It’s never you it’s always your #energy link 👇#spiritualtiktok #goodbooks ♬ Horror train, horror piano, BGM(1230538) – syummacha Internet culture is chaotic—but we’ll break it down for you in one daily email. Sign up for the Daily Dot’s web_crawlr newsletter here. You’ll get the best (and worst) of the internet straight into your inbox. Advertisement More in Trending ‘This is important’: Doctor shares whether you should keep washing machine door closed or open ‘If I’m spending 1,000+ on a phone I want my bag’: Former Apple Store worker exposes how these rules force them to deny you perks ‘This is actually genius for some folks’: O’Reilly’s customer shocked when he discovers the store sells body wash. Then he learns the reason why ‘So we looked at Lowe’s and Home Depot’: Man nearly purchases new dryer. Then he realizes you can buy one at Costco for $530—it includes all this Advertisement Advertisement Share this article Link copied! TAGS Nestle TikTok Walmart First published: Mar 19, 2025, 4:35 pm CDT Ford Sanders Ford Sanders is an Independent Journalist and content creator based in Austin, TX. He has built a platform of over 100,000 people who he consistently shares the news, daily vlogs and other content with. Prior to doing content full time, Ford Sanders joined the KVUE News team in October of 2022 as an on-air reporter/multiskilled journalist. He is originally from Nashville, Tennessee, and is a graduate of the University of Tennessee Knoxville, where he earned a degree in journalism and electronic media. Before KVUE News, he was working in Louisville, Kentucky. There, he covered stories ranging from devastating floods across eastern Kentucky to the federal investigation into the Breonna Taylor case involving the indictments of four Louisville Metro Police Department officers. Prior to his time in Louisville, Ford reported in eastern North Carolina, covering a variety of topics and breaking news across the Innerbanks and Outerbanks. He also reported for WVLT News in Knoxville, Tennessee, as a digital reporter/content producer while in college. He parted ways with the company when he was offered an internship with CBS News in New York City and CBS Evening News with Norah O’Donnell. Prior to his time at WVLT News, Ford lived in Prague, Czech Republic, for the summer of 2019 and worked as an international fellow with Transitions Online News and Reuters. Ford is excited to be in Central Texas and is happy to know it’s an easy flight away from his hometown in Tennessee. Here’s how you can connect with Ford and send him story ideas: Email: fordsandersnews@gmail.com TikTok: @fordsanders Twitter: @fordsanderstv Instagram: @fordsanders Search for:",
        "topics": [
            "frozen meals",
            "lean cuisines",
            "meals recalled",
            "cuisines products",
            "lean cuisine"
        ]
    },
    {
        "title": "Nestle recalling some Lean Cuisine, Stouffer's meals over possible 'wood-like material'",
        "url": "https://biztoc.com/x/b0252779d8a00430",
        "content": "Nestle recalling some Lean Cuisine, Stouffer's meals over possible 'wood-like material' BizToc MENU Login / Sign Up Home Wire Flash Light Mode Imagery Search Settings & Dark Mode Customize News Grid Official API GPT Plugin Facebook Twitter RSS Feed Why did 23andMe seek bankruptcy protection? What drives Tesla's diner project progress? What spurred Gold Fields' all-cash offer? Why did investors doubt Novo Nordisk's obesity trial? How will Sunac's debt issues affect its future? Why is Malaysia tightening chip export rules? What drives Bitcoin's predicted bull stage? Why did Nio warn of disappointing Q1? What spurred Elliott's stake in Sumitomo Realty? Nestle recalling some Lean Cuisine, Stouffer's meals over possible 'wood-like material' thehill.com/business/5200214-nestle-recall-lean-cuisine-stouffers (KNWA/KFTA) — Nestle says it is recalling a limited quantity of Lean Cuisine and Stouffers meals because they could contain \"wood-like material,\" according to a news release.The recall is for batches of Lean Cuisine Butternut Squash Ravioli, Lean Cuisine Spinach Artichoke Ravioli, Lean… This story appeared on thehill.com, 2025-03-19 12:08:30. Facebook Twitter RSS Feed About ⁞ API ⁞ Contact ⁞ Legal ⁞ Status The Entire Business World on a Single Page. Free to Use →",
        "topics": [
            "stouffer meals",
            "stouffers meals",
            "cuisine stouffers",
            "cuisine stouffer",
            "lean cuisine"
        ]
    },
    {
        "title": "Nestle is recalling Lean Cuisine and Stouffer’s meals because they may contain ‘wood-like material’ linked to choking",
        "url": "https://biztoc.com/x/d8e32aa981893804",
        "content": "Nestle is recalling Lean Cuisine and Stouffer’s meals because they may contain ‘wood-like material’ linked to choking BizToc MENU Login / Sign Up Home Wire Flash Light Mode Imagery Search Settings & Dark Mode Customize News Grid Official API GPT Plugin Facebook Twitter RSS Feed Why did 23andMe seek bankruptcy protection? What drives Tesla's diner project progress? What spurred Gold Fields' all-cash offer? Why did investors doubt Novo Nordisk's obesity trial? How will Sunac's debt issues affect its future? Why is Malaysia tightening chip export rules? What drives Bitcoin's predicted bull stage? Why did Nio warn of disappointing Q1? What spurred Elliott's stake in Sumitomo Realty? Nestle is recalling Lean Cuisine and Stouffer’s meals because they may contain ‘wood-like material’ linked to choking fortune.com/2025/03/20/nestle-recalling-lean-cuisine-stouffers-meals-wood-like-material-choking Nestle USA is recalling certain batches of its Lean Cuisine and Stouffer's frozen meals for possible contamination with “wood-like material\" after a report of potential choking.The recall applies to limited quantities of meals with best-before dates between September 2025 and April… This story appeared on fortune.com, 2025-03-20 09:43:04. Facebook Twitter RSS Feed About ⁞ API ⁞ Contact ⁞ Legal ⁞ Status The Entire Business World on a Single Page. Free to Use →",
        "topics": [
            "stouffers meals",
            "stouffer meals",
            "choking nestle",
            "meals wood",
            "cuisine stouffers"
        ]
    },
    {
        "title": "Stock market update: Stocks that hit 52-week lows on NSE",
        "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-stocks-that-hit-52-week-lows-on-nse/articleshow/119101695.cms",
        "content": "52 week high stocks: Stock market update: Stocks that hit 52-week lows on NSE - The Economic Times Benchmarks Nifty23,193.25285.66FEATURED FUNDS★★★★★Canara Robeco ELSS Tax Saver Regular - Growth5Y Return24.73 % Invest NowFEATURED FUNDS★★★★★HSBC Large Cap Fund Direct-Growth5Y Return23.07 % Invest NowEnter search text:English EditionEnglish Editionहिन्दीગુજરાતીमराठीবাংলাಕನ್ನಡമലയാളംதமிழ்తెలుగు | Today's ePaper My Watchlist SubscribeSign InHomeETPrimeMarketsMarket DataAI MasterclassNewsIndustrySMEPoliticsWealthMFTechAICareersOpinionNRIPanacheMore MenuStocksNewsLive BlogStock Live BlogEarningsPodcastMarket ClassroomDons of Dalal StreetRecosStock Reports PlusNewMy ScreenerCandlestick ScreenerStock ScreenerStock WatchMarket CalendarStock Price QuotesOptionsIPOs/FPOsExpert ViewsInvestment IdeasCommoditiesViewsNewsOthersMentha OilPrecious MetalsGold MGoldSilverGold PetalSilver MicroSilver MGold GuineaOil & EnergyNatural GasCrude OilCrude Oil MiniBase MetalsAluminiumZinc MiniLead MiniCopperZincNickelAluminium MiniLeadPlantationKapasCotton CandyForexForex NewsCurrency ConverterLive Stream!Basics of crypto and blockchainAIF PMSCryptocurrencyCrypto NewsCrypto TVCrypto Returns CalculatorCrypto PricesAll CryptosMoreTechnicalsTechnical ChartVisualizeScreenerMind Over MoneyWeb StoriesMarkets DataUnlisted CompaniesMarket MogulsBondsWebinarsSitemapDefinitionsBusiness News›Markets›Stocks›Stock Watch›Stock market update: Stocks that hit 52-week lows on NSE The Economic Times daily newspaper is available online now. Read Today's Paper Stock market update: Stocks that hit 52-week lows on NSESECTIONSStock market update: Stocks that hit 52-week lows on NSEETMarkets.comLast Updated: Mar 17, 2025, 10:55:00 AM ISTRate StoryFollow usShareFont SizeAbcSmallAbcMediumAbcLargeSavePrintCommentSynopsis BPCL, Nestle India, Britannia, Wipro and Hero MotoCorp were among the top losers on NSE.Shutterstock.comIndia 10-year bond yield jumped 0.38 per cent to 6.03 after trading in 6.01 - 6.04 range.NEW DELHI: Global Education, Inventurus Knowledge, One Mobikwik Systems, Quality Power Electr and Ola Electric Mobilit and others were among the stocks that touched their 52-week lows as of 10:55AM(IST)in Monday's session. Domestic benchmark index NSE Nifty gained 81.0 points to 22478.2, while the BSE Sensex traded 266.35 points up at 74095.26. On the other hand, NACL Industries, Steel Cast, Kamat Hotels, Reliance Naval & Engg and India Shelter Finance Corp stocks hit their fresh 52-week highs today. In the Nifty 50 index, Dr. Reddys, IndusInd Bank, SBI Life, Cipla and Bajaj Finserv were among the top gainers on the NSE. BPCL, Nestle India, Britannia, Wipro and Hero MotoCorp were among the top losers. Live Events (You can now subscribe to our ETMarkets WhatsApp channel)Read More News on52 week high stocksnse 52 week high52 week high stocks todaynse stocks updateNSE updates today(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today. Top Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price...moreless(You can now subscribe to our ETMarkets WhatsApp channel)Read More News on52 week high stocksnse 52 week high52 week high stocks todaynse stocks updateNSE updates today(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today. Top Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price...morelessPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth EditionIndusInd Bank shares crash 36%. Should investors buy or wait for a trend?Nations shouldn’t gnash their teeth on Trump tariffs. They should just John Nash it.GG Engineering alleged stock price manipulation: Sebi probes promoters of two listed firmsFed's pause puts spotlight on RBI’s optionsThe woman who made Delhi go DalíHow Hang Seng is making Indian investors smile, and the risks you must weigh123View all StoriesMost Searched StocksIRFC Share Price128.6203:06 PM | 20 Mar 20250.51(0.4%)Suzlon Energy Share Price58.3803:06 PM | 20 Mar 20250.63(1.08%)IREDA Share Price150.103:06 PM | 20 Mar 2025-1.78(-1.17%)Tata Motors Share Price689.7503:06 PM | 20 Mar 20257.5(1.1%)YES Bank Share Price16.9603:06 PM | 20 Mar 2025-0.08(-0.42%)HDFC Bank Share Price1769.8503:06 PM | 20 Mar 202525.75(1.48%)NHPC Share Price80.103:06 PM | 20 Mar 2025-0.11(-0.13%)RVNL Share Price357.003:06 PM | 20 Mar 20253.36(0.95%)SBI Share Price750.0503:06 PM | 20 Mar 20254.95(0.67%)Tata Power Share Price371.103:06 PM | 20 Mar 2025-0.35(-0.1%)Tata Steel Share Price159.003:06 PM | 20 Mar 20250.41(0.26%)Adani Power Share Price520.503:06 PM | 20 Mar 2025-0.5(-0.1%)PayTM Share Price734.9503:06 PM | 20 Mar 2025-28.15(-3.69%)PNB Share Price91.4603:06 PM | 20 Mar 20250.44(0.49%)Zomato Share Price224.2603:06 PM | 20 Mar 20250.73(0.33%)BEL Share Price296.7503:06 PM | 20 Mar 20256.75(2.33%)BHEL Share Price206.7803:06 PM | 20 Mar 20251.1(0.53%)Infosys Share Price1618.8503:06 PM | 20 Mar 202532.3(2.04%)IRCTC Share Price714.003:06 PM | 20 Mar 2025-3.65(-0.51%)ITC Share Price404.303:06 PM | 20 Mar 20251.25(0.32%)Jio Financial Services Share Price231.7303:06 PM | 20 Mar 20252.89(1.27%)LIC Share Price780.4503:06 PM | 20 Mar 20253.71(0.48%)RIL Share Price1268.8503:06 PM | 20 Mar 202521.7(1.74%)HAL Share Price3827.003:06 PM | 20 Mar 202586.35(2.31%)JP Power Share Price14.6303:06 PM | 20 Mar 2025-0.12(-0.82%)NBCC Share Price82.9903:06 PM | 20 Mar 2025-0.35(-0.41%)TCS Share Price3563.703:06 PM | 20 Mar 202566.6(1.91%)Vedanta Share Price470.303:06 PM | 20 Mar 20259.75(2.12%)Wipro Share Price267.8503:06 PM | 20 Mar 20252.16(0.81%)Indian Oil Corp. Share Price129.5703:06 PM | 20 Mar 20251.82(1.43%)Ircon Intl. Share Price159.9903:06 PM | 20 Mar 20254.58(2.95%)SAIL Share Price114.1703:06 PM | 20 Mar 20250.94(0.84%)SJVN Share Price91.1803:06 PM | 20 Mar 2025-0.53(-0.58%)GAIL Share Price168.6103:06 PM | 20 Mar 20252.66(1.6%)HUDCO Share Price199.2203:06 PM | 20 Mar 2025-1.87(-0.93%)REC Share Price429.0503:06 PM | 20 Mar 2025-0.45(-0.11%)Reliance Power Share Price36.4503:06 PM | 20 Mar 2025-1.27(-3.37%)Tata Technologies Share Price667.303:06 PM | 20 Mar 2025-4.0(-0.6%)Vodafone Idea Share Price7.2803:06 PM | 20 Mar 2025-0.17(-2.16%)Adani Ent. Share Price2340.703:06 PM | 20 Mar 202522.05(0.96%)Adani Green Share Price921.203:06 PM | 20 Mar 202510.0(1.1%)Adani Ports SEZ Share Price1177.2503:06 PM | 20 Mar 20253.75(0.32%)Ashok Leyland Share Price207.4503:06 PM | 20 Mar 20251.76(0.86%)Bank of Baroda Share Price215.6503:06 PM | 20 Mar 20251.9(0.89%)BSE Share Price4487.503:06 PM | 20 Mar 202595.06(2.17%)Canara Bank Share Price85.903:06 PM | 20 Mar 20250.34(0.39%)CDSL Share Price1170.0503:06 PM | 20 Mar 2025-3.21(-0.28%)Coal India Ltd Share Price396.3503:06 PM | 20 Mar 20250.5(0.13%)HFCL Share Price81.5303:06 PM | 20 Mar 2025-0.49(-0.59%)IDFC First Bank Share Price55.7603:06 PM | 20 Mar 20250.34(0.62%)Load more..Trending in MarketsPolycab Stock PriceGarden Reach Shipbuilders Share PriceSensex Today Live UpdatesStocks in News TodayMobiKwik Share PriceIndusInd Bank SharesWhy IndusInd Bank Share is Falling?Pi Coin Price PredictionHexaware Technologies Share PriceNykaa Q3 ResultsVA Tech Wabag ShareLIC Q3 ResultsSBI share priceBharti Airtel Share PriceReliance Power Stock PriceSwiggy Stock PriceSwiggy Results 2025Gold Price TodayVishal Mega Mart Share PriceONGC Share PriceITC Shares PriceBudget day trading strategyAdani Enterprises Q3 Results 2025Adani Ports Share PriceBajaj Finserv Share PriceWhirlpool India Share PriceTata Motors Stock PriceKPIT Share PriceAmbuja Cement Q3 Results FY25Maruti Suzuki Q3 Results FY25Latest from ETAir India mulls multi-billion dollar jet order to Airbus & BoeingSensex soars 1,000 points. What unleashed the bulls?Akasa’s ambitions face risk due to Boeing’s delaysEnter search text:BrowseCompanies:ABCDEFGHIJKLMNOPQRSTUVWXYZ123456789Hot on WebMORELTA Proofs Submission DeadlineFed Rate CutKEI Industries Share PricePolycab Share PriceGRSE Share PriceNCC Share PriceHappy Nowruz 2025Sensex TodayStocks in NewsSunita Williams Return LiveXRP price todayIRS stimulus checkGATE Results 2025GRSE Share PriceGold Expected PriceGratuity Payment before 5 yearsNasa Astronauts Sunita Williams, Butch Wilmore PicsIn Case you missed itMOREStock Market LIVEAfcons InfrastructureIREDA Q2 ResultsReliance Power Preferential IssueManba Finance IPOHDB Financial Services IPOCochin Shipyard Share PriceNorthern Arc Capital IPO AllotmentArkade Developers IPO Allotment TodayStocks in news todayUS Fed Meeting TimeUS Fed Rate Cut TodayNSE Bonus Issue Record DateBSE Share PriceBajaj Housing Finance IPO Listing LiveBajaj Housing Finance Share PriceTata Power Share PriceMORETop Searched CompaniesIRFC share priceSuzlon share priceIREDA share priceTATA Motors share priceYes bank share priceHDFC Bank share priceNHPC share priceRVNL share priceSBI share priceTata power share priceTata steel share priceAdani power share pricePaytm share pricePNB share priceZomato share priceBEL share priceBHEL share priceInfosys share priceIRCTC share priceITC share priceJIO finance share priceLIC share priceReliance share priceHAL share priceJP Power share priceNBCC share priceTCS share priceVedanta share priceWipro share priceIOC share priceIrcon share priceSAIL share priceSJVN share priceGAIL share priceHUDCO share priceREC share priceReliance Power share priceTata Technologies share priceVodafone idea share priceAdani Enterprises share priceAdani Green share priceAdani Port share priceAshok Leyland share priceBank of Baroda share priceBSE share priceCanara Bank share priceCDSL share priceCoal India share priceHFCL share priceIDFC First Bank share priceTop CalculatorsMOREStandard Deviation CalculatorIncome Tax CalculatorAge CalculatorSIP CalculatorTime CalculatorBMI CalculatorGPA CalculatorStatistics CalculatorFraction CalculatorDiabetes Risk CalculatorDate CalculatorLog CalculatorMORETop Prime Articles4 Insights To Kick Start Your Day Featuring Tatas Ev Biz Stake Sale4 Insights To Kick Start Your Day Featuring Airtels Big Potential Deal With PaytmYuan Internationalisation Sees Significant Progress In 2022 Can It Maintain The Momentum3 Insights To Kick Start Your Day Featuring Mukesh Ambani Repeating Old PlaybookAfter Dodging Bankruptcy Thrice In Five Years Rolta India Has Been Dragged To Insolvency Court AgainLithium Found In Jk Heres How To Turn It Into A Catalyst For Indias Clean Energy MissionHirakud Industrial Works Insolvency How Hindalco And Hirakud Workers Union Unveiled A Staged ActAdani Fiasco Interest Rates Geopolitical Tensions Why 2023 Will Be A Tough Year For InvestorsHow To Ensure The Fair Use Of The Data That Powers Conversational Generative Ai Tools Like ChatgptCan Mauritius African Odyssey Steer Clear Of The Hindenburg Adani Sized IcebergMORETop Performing MFSBI Long Term Equity FundSBI Balanced Advantage Fund RegularSbi Dividend Yield Fund Regular PlanSBI Contra FundAditya Birla Sun Life Multi Asset Allocation Fund Regular PlanMORETop DefinitionsMicroeconomicsPseudocodeRandom SamplingUnion BudgetTradeMORETop CommoditiesKapas RateNickel RateCotton RateZinc RateCrudeoil RateMORETop SlideshowItcIncome Tax Rule Change Salaried Individuals Pensioners Must KnowYouve Been Doing It WrongHg Infra EngineeringHow Much Standard Deduction Will Family Pensioners GetHow Much Standard Deduction Will Family Pensioners GetIncome Tax Rule Change Salaried Individuals Pensioners Must KnowHg Infra EngineeringItcYouve Been Doing It WrongMORETop Story ListingUidaiPulwama AttackRbi PolicyFixed DepositUae VisaLatest NewsBihar tops list for e-challans in minor driving offences as Delhi barely registers a blip in 2 yearsDominance of foreign airlines on international routes to benefit Indian carriers: ICRARajasthan bows to Rs 7,000 crore coaching industry, dilutes provisions in new Bill despite rising student suicidesCapable women shouldn't ask for interim alimony, law doesn't promote idling: Delhi HCGovernment didn't participate in any exercise related to Corruption Perception Index: Centre in RSRahul Gandhi meets Punjab Congress MPs protesting over farmers' issueSculptor Ram Sutar to get Maharashtra Bhushan award: CM Devendra FadnavisChina says acted 'in accordance with the law' after 4 Canadians executedRajya Sabha adjourned for the day amid row over DMK members wearing T-shirts with 'fair delimitation' slogansPSUs emerge as bright spot for investment banks amid recent correction: EmkayIndian 5G user base to grow to 770 million by 2028; average data use peaks to 40 GB: NokiaT-shirts with slogans: Lok Sabha adjourned for the day amid protest by opposition membersCouple’s epic photo shoot in Bengaluru goes wrong; Bride suffers burn injuries due to colour bomb mishapGold and Silver ETFs offer over 30% average return in one year. Did you miss the shine?Sundar Pichai on Google's massive $32 billion Wiz deal: 'We don't make deals like this...'Follow us on:Download ET App:subscribe to our newsletterCopyright © 2025 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication ServiceFind this comment offensive?Choose your reason below and click on the Report button. This will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain communityOthersYour Reason has been Reported to the admin.XTo post this comment you mustLog In/Connect with:The Economic TimesorFill in your details:Will be displayedWill not be displayedWill be displayedShare this Comment:Post to TwitterContinue reading with one of these options:Limited AccessFreeLogin to get access to some exclusive stories & personalised newslettersLogin NowUnlimited AccessStarting @ Rs120/monthGet access to exclusive stories, expert opinions & in-depth stock reportsSubscribe NowETUh-oh! This is an exclusive story available for selected readers only.Worry not. You’re just a step away.Sign In to Read for FreePrime Account Detected!It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.Sign in & Access ET PrimeAlready a Member? Sign In nowSubscribe NowAlready a Member? Sign In nowOffer Exclusively For YouSave up to Rs. 700/-ON ET PRIME MEMBERSHIPAvail OfferOffer Exclusively For YouGet 1 Year FreeWith 1 and 2-Year ET prime membershipAvail OfferOffer Exclusively For YouGet 1 Year FreeWith 1 and 2-Year ET prime membershipAvail OfferOffer Exclusively For YouGet Flat 40% OffThen ₹ 1749 for 1 yearAvail OfferOffer Exclusively For YouET Prime at ₹ 49 for 1 monthThen ₹ 1749 for 1 yearAvail OfferSpecial OfferGet flat 35% off on ETPrimeAvail OfferAvail Offer Continue with Google or Continue with Mobile 90 Days Prime access worth Rs999 unlocked for youClaim NowAlready a Member? Sign In nowWhy ?Stories you might be interested inSubscribe to ourET Investment OpportunitiesSUBMIT",
        "topics": [
            "stocksnse 52",
            "high stocks",
            "high stocksnse",
            "stocks hit",
            "36 investors"
        ]
    },
    {
        "title": "Stouffer’s And Lean Cuisine Recall—Wood Fragments Found In Frozen Meals",
        "url": "https://www.forbes.com/sites/stephaniegravalese/2025/03/19/stouffers-and-lean-cuisine-recall-wood-fragments-found-in-frozen-meals/",
        "content": "Nestle’s Lean Cuisine Recall—Wood Fragments Found In Frozen MealsSubscribe To NewslettersNestle’s Lean Cuisine Recall—Wood Fragments Found In Frozen MealsByStephanie GravaleseFollowShareSaveCommentLifestyleDiningNestle’s Lean Cuisine Recall—Wood Fragments Found In Frozen MealsByStephanie Gravalese, Contributor. Forbes contributors publish independent expert analyses and insights. I write about restaurants and food culture, from farm to forkFollow AuthorMar 19, 2025, 11:54am EDTShareSaveCommentThis frozen food recall affects popular Stouffer's and Lean Cuisine meals—here’s how to check your ... More freezer and stay safe.Nestle It may not be lunch time yet, but before you head to the microwve, check your freezer—certain Lean Cuisine and Stouffer’s frozen meals are being recalled due to the possible presence of wood fragments. Nestlé USA has voluntarily recalled and pulled select batches of these products after multiple consumer complaints, including a report of a potential choking incident. According to Nestlé’s recall notice, the company is investigating how the contamination happened. Nestlé says this is an isolated issue and is working with the FDA and USDA to address it. \"We are taking this action after consumers contacted Nestlé USA about this issue, including one potential choking incident to date.\" What’s Being Recalled?Stouffer's and Lean Cuisine Recall: Wood Fragments Found in Popular Frozen Meals—What You Need to ... More Knowgetty This recall affects popular frozen meals from Stouffer’s and Lean Cuisine, sold at major retailers nationwide. The impacted products were distributed between September 2024 and March 2025 and include: Lean Cuisine Butternut Squash Ravioli (Batch Code: 4214595511, Best Before: SEPT2025) Spinach Artichoke Ravioli Lemon Garlic Shrimp Stir Fry Stouffer’s Party Size Chicken Lasagna (96oz) Batch codes can be found on the side of the product packaging. If you have one of these meals in your freezer, check the code before consuming. MORE FOR YOU‘The White Lotus’ Season 3, Episode 6 Recap And Review: Killer Instinct‘Clear Provocation’: Greenland Leader Decries Upcoming Visit By Trump Officials And Usha Vance‘First And Foremost, Twain Hated Bullies.’ Conan O’Brien Accepts Mark Twain Prize With Profound Speech Why This Recall MattersIf you have recalled Lean Cuisine or Stouffer’s frozen meals, check your freezer immediately and ... More follow these safety steps.getty Finding foreign objects in food isn’t just a quality issue—it’s a serious safety concern. Wood fragments in frozen meals create a choking hazard and could potentially cause internal injuries if consumed. While no severe injuries have been confirmed, Nestlé has taken this precautionary step to reremove the affected products from shelves. The company is still determining how the contamination occurred and is working with the FDA and USDA to ensure safety measures are in place. If you have one of these recalled frozen meals, here’s what to do next. Check the batch code on the packaging. Do not eat the product, even if it looks fine. Return it to the store where you purchased it for a full refund or replacement. If you have questions, contact Nestlé USA at (800) 681-1676 (Monday-Friday, 9 a.m.-6 p.m. EST). How the Recall System WorksFrozen food recalls like this one help protect consumers by prompting manufacturers to investigate ... More and prevent future risks.getty Food recalls like this are part of an important system designed to prevent harm before it happens. When a potential contaminant—whether foreign material, bacteria, or an undeclared allergen—is identified, companies work with the FDA and USDA to issue voluntary recalls. These recent recalls serve as a safeguard to remove potentially unsafe products before widespread harm occurs. While recalls can feel overwhelming, they serve an important purpose—making sure potentially harmful food doesn’t reach more consumers. Instead of waiting for widespread problems and, recalls aim to stop the risk early, even if that means pulling products off shelves before they’ve caused serious harm keeping consumer trust intact. For official details, check the FDA recall advisory page or visit Nestlé USA’s website for updates. MORE FROM FORBESForbesCoffee Creamer Recall? Over 75,000 International Delight Bottles PulledBy Stephanie GravaleseForbesTrader Joe’s Recalls 61,500 Bottles Of Sparkling Water—What To KnowBy Stephanie GravaleseForbes4 Food Recalls This Week—Amazon Fresh, Hummus And MoreBy Stephanie GravaleseForbesAnother Food Recall? Over 70,000 Cups Of Hummus Pulled For Plastic RiskBy Stephanie Gravalese Follow me on Twitter or LinkedIn. Check out my website or some of my other work.Editorial StandardsForbes AccoladesLOADING VIDEO PLAYER...FORBES’ FEATURED Video© 2025 Forbes Media LLC. All Rights Reserved.AdChoicesPrivacy StatementDo Not Sell or Share My Personal InformationLimit the Use of My Sensitive Personal InformationPrivacy PreferencesDigital Terms of SaleTerms of ServiceContact UsSend Us FeedbackReport a Security IssueJobs At ForbesReprints & PermissionsForbes Press RoomAdvertise",
        "topics": [
            "food recalls",
            "food recall",
            "meals recalled",
            "cuisine recall",
            "recalled frozen"
        ]
    },
    {
        "title": "Lean Cuisine and Stouffer's meals recalled for 'wood-like material' linked to choking",
        "url": "https://richmond.com/news/nation-world/article_7a99fde0-6f11-577c-aba8-99ccd393e41b.html",
        "content": "Lean Cuisine, Stouffer's recall includes ravioli, lasagna Skip to main contentSkip to main content You have permission to edit this article. Edit Close 48° Log In Subscribe Guest Logout Read Today's E-edition News Local Virginia Video Network Crime Politics State & Region Education Nation & World Markets & Stocks News Tip Business Local On the Move Top Workplaces Obituaries Share a story Recent Obituaries Find an Obituary Archives Opinion Submit a letter Letters Editorial Columnists Sports High School College Professional Betting Casino Lifestyles Event Calendar Arts & Theatre Movies & TV Music Comics Puzzles Contests Play Food & Cooking Home & Garden Health Get Healthy Parenting Fashion Pets Travel Faith Announcements Sponsored Features Join the community News tip Share video Send a story Share a photo Brand Ave. Studios Print Edition E-edition E-edition Archives Today's Ads Special Sections Our Publications Mechanicsville Local Powhatan Today Goochland Gazette Buy & Sell Place an Ad Jobs Cars Marketplace Shop Local Public Notices Buyer's Guide RTD Merchandise Shopping Customer Service Manage Subscription Activate Digital Subscription Subscribe Newsletter sign-up Contact Us Advertise with RTD Help Center Gift Subscriptions Mobile Apps Weather: Live Radar Facebook Twitter LinkedIn Instagram © 2025 Lee Enterprises Terms of Service | Privacy Policy Subscribe Read Today's E-edition Subscribe Log In Welcome, Guest My Subscription Help Center My Account Dashboard Profile Saved items Logout E-edition News Business Obituaries Opinion Sports Puzzles Lifestyles Public Notices Jobs 48° Partly Cloudy Share This Facebook Twitter WhatsApp SMS Email Lean Cuisine and Stouffer's meals recalled for 'wood-like material' linked to choking 0 Comments Share this Facebook Twitter WhatsApp SMS Email Print Copy article link Save AP Spotlight Lean Cuisine and Stouffer's meals recalled for 'wood-like material' linked to choking JONEL ALECCIA AP Health Writer Mar 20, 2025 Mar 20, 2025 Updated Mar 20, 2025 0 × Cover Media - Shareable Nestlé CEO Laurent Freixe defended packaged food, emphasizing its role in providing safe nutrition and reducing waste amid growing scrutiny. His comments came as the U.S. Senate moved closer to confirming Robert F. Kennedy Jr. as the next Secretary of Health and Human Services under Presiden… Facebook Twitter WhatsApp SMS Email Print Copy article link Save Nestle USA is recalling certain batches of its Lean Cuisine and Stouffer's frozen meals for possible contamination with \"wood-like material\" after a report of potential choking.The recall applies to limited quantities of meals with best-before dates between September 2025 and April 2026. They include Lean Cuisine Butternut Squash Ravioli, Lean Cuisine Spinach Artichoke Ravioli, Lean Cuisine Lemon Garlic Shrimp Stir Fry and Stouffer's Party Size Chicken Lasagna. The products were distributed to major stores in the U.S. between September 2024 and this month. No products beyond those listed are affected. This undated photo released by the U.S. Food and Drug Administration shows a box of a Lean Cuisine meal. U.S. Food and Drug Administration via Associated Press Nestle officials said they are working with the U.S. Food and Drug Administration and the Agriculture Department and investigating the source of the wood-like material. The company said it launched the recall after consumers reported the problem, including at least one potential choking incident. People are also reading… Former U.S. attorney Jessica Aber, 43, dies in Alexandria home Odom-to-UVa confirmed; VCU opens search for next head coach. Who are the candidates? Hanover High baseball coach steps down 1 game into season amid controversy, mystery Baseball coach suing Midlothian High and Chesterfield schools, alleging racism and ageism Land sold near Chesterfield surf park development What does the future of VCU basketball look like? Coaching candidates, roster overhaul. Richmond plans to narrow section of Midlothian Turnpike The end of Thalhimers, the last department store in downtown Richmond VCU eliminates its DEI office, following Trump's order Road to Richmond selection show for NWBA National Championships Mom's Siam reopens after temporary closure, still embroiled in labor dispute Filmmaker Ken Burns visits Richmond for his new series 'The American Revolution' 89-year-old woman dies after catching fire while smoking cigarette Youngkin: Virginia ready to take full responsibility for K-12 education Opinion: When VCU left the Coliseum, Richmond lost its game. Why not run it back? Listen now and subscribe: Apple Podcasts | Spotify | RSS Feed | SoundStack | All Of Our Podcasts Consumers should check batch codes and best-before dates in the company's recall listing to identify the effected products. The 10-digit batch code is printed on the side of product packages. Don't prepare or consume the products; instead, return them to the store where they were purchased for a replacement or refund. Contact Nestle USA at (800) 681-1676 from 9 a.m. to 6 p.m. EDT Monday through Friday with any questions.___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute's Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content. States Most Impacted by Food Recalls in Recent Years [2025 Edition] States Most Impacted by Food Recalls in Recent Years [2025 Edition] Photo Credit: New Africa / ShutterstockPotato salad with foreign plastic. Mixed greens with listeria exposure. Ice cream with metal fragments. Cookies with undeclared nut allergens. Dried pasta with mold contamination.These are just a few examples of recent food recalls issued by the U.S. federal government.Food recalls frequently generate headlines and public concern because of their associated safety risks and health hazards. To help protect consumers, government officials have developed a system of regulation and oversight that identifies potentially unsafe products and issues recalls that get those products off of store shelves and out of consumers’ homes.This system of oversight is a shared responsibility of the U.S. Food and Drug Administration and the U.S. Dept. of Agriculture. Each agency is authorized by law to oversee certain types of farms and food production facilities, with sometimes overlapping jurisdiction. As the agencies identify hazardous products, they can issue recalls to minimize risks to consumers.Both the USDA and the FDA distinguish between Class I, Class II, and Class III food recalls to signify the level of risk associated with each. While the two agencies’ systems are slightly different, the general classifications used are similar. Class I recalls are for the most hazardous products, which have higher risks of causing serious adverse health consequences or death, while Class II recalls have more moderate risks and Class III recalls have minimal risks. New Africa Trends in U.S. Food Recalls The total number of food recalls increased by 15% between 2020 and 2024Source: Trace One analysis of 2020–2024 FDA and USDA dataOver the past few years, the number of food recalls issued by the two agencies has increased. From 2020 to 2023, the total number of recalls grew from 454 to 547, an increase of more than 20%. This growth took place across all classes of recall, but notably the number of Class I recalls has increased in each year since 2020. And while the volume of food recalls declined slightly in 2024, it remained over 15% higher than in 2020. Common Causes of Food Recalls Allergen contamination is responsible for the largest share of recallsSource: Trace One analysis of 2020–2024 FDA dataThe leading causes of food recalls are allergen, bacterial, and foreign object contamination. Allergen contamination, responsible for approximately 38% of all cases, occurs when products are exposed to allergens like wheat, dairy, and nuts, often due to cross-contamination during manufacturing. Even trace amounts can trigger severe allergic reactions in sensitive individuals, making prevention and accurate labeling crucial.Bacterial contamination follows at 21.8%, with recalls for pathogens like salmonella, E. coli, and listeria. These bacteria can cause serious illness, particularly in vulnerable populations such as young children, the elderly, and those with weakened immune systems. Infections can lead to severe gastrointestinal distress, long-term health complications, and even death.Foreign object contamination accounts for 11.4% of recalls and includes materials such as rocks, insects, plastic, or metal. These contaminants can cause physical harm, such as choking, dental damage, or internal injuries if ingested.The least common but highly concerning are lead contamination recalls, comprising just 2.0% of the total between 2020 and 2024, yet attracting significant public attention due to their severe health risks. Recent high-profile lead recalls include contaminated applesauce pouches, which garnered extensive media coverage due to the potential harm to vulnerable populations. What Should Consumers Do When They Learn About a Food Recall? Photo Credit: Kristen Prahl / ShutterstockWhat you should do after learning about a food recall depends on the severity and reason for the recall. Some recalls, like those for undeclared allergens, may not pose a risk to you if you don’t have an allergy, while others—such as bacterial contamination or lead exposure—require immediate action.The first priority is to confirm whether you have the recalled item by checking details like the brand, product name, geographic distribution, and expiration date, which are usually provided in the official press release. If you have the recalled product, the FDA recommends checking the recall notice for specific instructions. In many cases, you can return the item for a refund, but if the product is contaminated, it’s best to seal it in a bag and dispose of it properly. Never donate recalled food or feed it to pets, as it may still pose a risk to others.If the recalled item was stored in your kitchen, clean any surfaces it may have touched, including countertops, utensils, and refrigerator shelves, with a proper sanitizing solution. If you or anyone in your household has consumed the product, watch for symptoms such as nausea, vomiting, diarrhea, or fever, especially if the recall involves bacteria or toxins. Seek medical attention if symptoms appear, particularly for those who are pregnant or have weakened immune systems. If you believe a food product has made you sick, reporting it to the FDA or USDA can help prevent further harm to others. Kristen Prahl Food Recalls by State (2020–2024) Nearly 40% of all recalls impact customers in California & 16% originate from its producersSource: Trace One analysis of 2020–2024 FDA and USDA dataFood recalls are a nationwide concern, but some states have been disproportionately affected in recent years. California is the nation’s largest producer of food, and as such, the state is also responsible for the largest share of all recalls. Between 2020 and 2024, nearly 16% of recalls originated from California products, approximately double the share of the next-closest state. And as the nation’s most populous state and a large market for food, California customers are also most frequently affected by recalls. Over the same time period, 38.5% of all recalls nationally impact residents in California, with residents in other large states like New York, Pennsylvania, Illinois, and Texas following close behind.This analysis was conducted by Trace One, a company specializing in regulatory compliance for the food and beverage industry, using data from the USDA and FDA. For a complete breakdown of food recall statistics by state for the period 2020–2024, as well as more information on how the analysis was conducted, see the original report: States Most Impacted by Food Recalls in Recent Years [2025 Edition]. Methodology Photo Credit: New Africa / ShutterstockData sources include the USDA’s Recalls & Public Health Alerts database as well as the FDA’s Enforcement Reports database. To calculate which states have been most impacted by food recalls in recent years, Trace One combined data on recall events from both sources for the years 2020–2024. Each recall event was categorized based on its classification, reason for recall, location(s) impacted, and producer location. Recall events that were listed as national in scope were added to the totals of each state. Due to the unstructured nature of the datasets, a combination of natural language processing and manual techniques were used to categorize recalls. As such, small discrepancies between the counts presented in this analysis and other published reports are likely present. Additionally, currently active recalls and estimates pertaining to producer locations are based on FDA data only, which account for over 90% of total recall events.For complete results, see States Most Impacted by Food Recalls in Recent Years [2025 Edition] on Trace One. New Africa 0 Comments Love 0 Funny 0 Wow 0 Sad 0 Angry 0 Related to this story Nestlé CEO Backs Packaged Food as Kennedy's Health Policies Loom Nestlé CEO Laurent Freixe defended packaged food, emphasizing its role in providing safe nutrition and reducing waste amid growing scrutiny. H… Watch Now: Related Video Gov. Glenn Youngkin speaks about protestors during the 250th anniversary of Patrick Henry's \"give me liberty or give me death\" speech AP Top Stories March 23 P AP AP Top Stories March 23 P AP Top Stories March 22 P AP AP Top Stories March 22 P Israel bombards Lebanon in heaviest exchange since ceasefire Israel bombards Lebanon in heaviest exchange since ceasefire × Facebook Twitter LinkedIn Instagram Sites & Partners En Forme Mechanicsville-Ashland Local Powhatan Today The Goochland Gazette Public Notices Contests Join our Team Get Healthy Services Manage Subscription About Us Contact Us Advertise with us Newsletter Sign up Become a Carrier Licensing Shopping © Copyright 2025 Richmond Times-Dispatch, 8460 Times Dispatch Blvd. Mechanicsville, VA 23116 Terms of Use | Privacy Policy | Advertising Terms of Use | Do Not Sell My Info | Cookie Preferences Powered by BLOX Content Management System from bloxdigital.com. Notifications Settings You don't have any notifications. Get up-to-the-minute news sent straight to your device. Topics Breaking News Subscribe Back × You are logged in Switch accounts Secure transaction. Cancel anytime. Have an account? Log In Back × Sign Up Account processing issue - the email address may already exist User information Username (Optional) This is the name that will be used to identify you within the system. Choose wisely! * First name * Last name Your real name will be displayed next to your photo for comments, blog posts, and more! * Email Address Your email address will be used to confirm your account. We won't share it with anyone else. * Password Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address. * Confirm Password Confirm your password. CAPTCHA Create Account Have an account? Log In × You're all set! Thank you . Your account has been registered, and you are now logged in. Check your email for details. OK Back × Log In Invalid password or account does not exist Email Address Password Forgot your password? Log In Email me a log in link Admin login Subscribe Need an account? Sign Up Back × Reset Password Submitting this form below will send a message to your email with a link to change your password. Email or Screen Name CAPTCHA Reset Password × Forgot Password An email message containing instructions on how to reset your password has been sent to the email address listed on your account. Back × Email me a log in link Account Email CAPTCHA Send Email Back × Promotional Offers Enter Promo Code Redeem No promotional rates found. Back × Purchase Gift Purchase Access × An error occurred × Secure & Encrypted What's your email address? Email Password Confirm password What's your name? First name Last name Who is this gift for? Recipient name Recipient email Optional message for the recipient Who is this gift from? Purchaser name Purchaser email Delivery date Delivery date What's your billing location? Address City State AlabamaAlaskaArizonaArkansasCaliforniaColoradoConnecticutDelawareFloridaGeorgiaHawaiiIdahoIllinoisIndianaIowaKansasKentuckyLouisianaMaineMarylandMassachusettsMichiganMinnesotaMississippiMissouriMontanaNebraskaNevadaNew HampshireNew JerseyNew MexicoNew YorkNorth CarolinaNorth DakotaOhioOklahomaOregonPennsylvaniaRhode IslandSouth CarolinaSouth DakotaTennesseeTexasUtahVermontVirginiaWashingtonWashington D.C.West VirginiaWisconsinWyomingPuerto RicoUS Virgin IslandsArmed Forces AmericasArmed Forces PacificArmed Forces EuropeNorthern Mariana IslandsMarshall IslandsAmerican SamoaFederated States of MicronesiaGuamPalauAlberta, CanadaBritish Columbia, CanadaManitoba, CanadaNew Brunswick, CanadaNewfoundland, CanadaNova Scotia, CanadaNorthwest Territories, CanadaNunavut, CanadaOntario, CanadaPrince Edward Island, CanadaQuebec, CanadaSaskatchewan, CanadaYukon Territory, Canada Zip Code Country United States of AmericaUS Virgin IslandsUnited States Minor Outlying IslandsCanadaMexico, United Mexican StatesBahamas, Commonwealth of theCuba, Republic ofDominican RepublicHaiti, Republic ofJamaicaAfghanistanAlbania, People's Socialist Republic ofAlgeria, People's Democratic Republic ofAmerican SamoaAndorra, Principality ofAngola, Republic ofAnguillaAntarctica (the territory South of 60 deg S)Antigua and BarbudaArgentina, Argentine RepublicArmeniaArubaAustralia, Commonwealth ofAustria, Republic ofAzerbaijan, Republic ofBahrain, Kingdom ofBangladesh, People's Republic ofBarbadosBelarusBelgium, Kingdom ofBelizeBenin, People's Republic ofBermudaBhutan, Kingdom ofBolivia, Republic ofBosnia and HerzegovinaBotswana, Republic ofBouvet Island (Bouvetoya)Brazil, Federative Republic ofBritish Indian Ocean Territory (Chagos Archipelago)British Virgin IslandsBrunei DarussalamBulgaria, People's Republic ofBurkina FasoBurundi, Republic ofCambodia, Kingdom ofCameroon, United Republic ofCape Verde, Republic ofCayman IslandsCentral African RepublicChad, Republic ofChile, Republic ofChina, People's Republic ofChristmas IslandCocos (Keeling) IslandsColombia, Republic ofComoros, Union of theCongo, Democratic Republic ofCongo, People's Republic ofCook IslandsCosta Rica, Republic ofCote D'Ivoire, Ivory Coast, Republic of theCyprus, Republic ofCzech RepublicDenmark, Kingdom ofDjibouti, Republic ofDominica, Commonwealth ofEcuador, Republic ofEgypt, Arab Republic ofEl Salvador, Republic ofEquatorial Guinea, Republic ofEritreaEstoniaEthiopiaFaeroe IslandsFalkland Islands (Malvinas)Fiji, Republic of the Fiji IslandsFinland, Republic ofFrance, French RepublicFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabon, Gabonese RepublicGambia, Republic of theGeorgiaGermanyGhana, Republic ofGibraltarGreece, Hellenic RepublicGreenlandGrenadaGuadaloupeGuamGuatemala, Republic ofGuinea, Revolutionary People's Rep'c ofGuinea-Bissau, Republic ofGuyana, Republic ofHeard and McDonald IslandsHoly See (Vatican City State)Honduras, Republic ofHong Kong, Special Administrative Region of ChinaHrvatska (Croatia)Hungary, Hungarian People's RepublicIceland, Republic ofIndia, Republic ofIndonesia, Republic ofIran, Islamic Republic ofIraq, Republic ofIrelandIsrael, State ofItaly, Italian RepublicJapanJordan, Hashemite Kingdom ofKazakhstan, Republic ofKenya, Republic ofKiribati, Republic ofKorea, Democratic People's Republic ofKorea, Republic ofKuwait, State ofKyrgyz RepublicLao People's Democratic RepublicLatviaLebanon, Lebanese RepublicLesotho, Kingdom ofLiberia, Republic ofLibyan Arab JamahiriyaLiechtenstein, Principality ofLithuaniaLuxembourg, Grand Duchy ofMacao, Special Administrative Region of ChinaMacedonia, the former Yugoslav Republic ofMadagascar, Republic ofMalawi, Republic ofMalaysiaMaldives, Republic ofMali, Republic ofMalta, Republic ofMarshall IslandsMartiniqueMauritania, Islamic Republic ofMauritiusMayotteMicronesia, Federated States ofMoldova, Republic ofMonaco, Principality ofMongolia, Mongolian People's RepublicMontserratMorocco, Kingdom ofMozambique, People's Republic ofMyanmarNamibiaNauru, Republic ofNepal, Kingdom ofNetherlands AntillesNetherlands, Kingdom of theNew CaledoniaNew ZealandNicaragua, Republic ofNiger, Republic of theNigeria, Federal Republic ofNiue, Republic ofNorfolk IslandNorthern Mariana IslandsNorway, Kingdom ofOman, Sultanate ofPakistan, Islamic Republic ofPalauPalestinian Territory, OccupiedPanama, Republic ofPapua New GuineaParaguay, Republic ofPeru, Republic ofPhilippines, Republic of thePitcairn IslandPoland, Polish People's RepublicPortugal, Portuguese RepublicPuerto RicoQatar, State ofReunionRomania, Socialist Republic ofRussian FederationRwanda, Rwandese RepublicSamoa, Independent State ofSan Marino, Republic ofSao Tome and Principe, Democratic Republic ofSaudi Arabia, Kingdom ofSenegal, Republic ofSerbia and MontenegroSeychelles, Republic ofSierra Leone, Republic ofSingapore, Republic ofSlovakia (Slovak Republic)SloveniaSolomon IslandsSomalia, Somali RepublicSouth Africa, Republic ofSouth Georgia and the South Sandwich IslandsSpain, Spanish StateSri Lanka, Democratic Socialist Republic ofSt. HelenaSt. Kitts and NevisSt. LuciaSt. Pierre and MiquelonSt. Vincent and the GrenadinesSudan, Democratic Republic of theSuriname, Republic ofSvalbard & Jan Mayen IslandsSwaziland, Kingdom ofSweden, Kingdom ofSwitzerland, Swiss ConfederationSyrian Arab RepublicTaiwan, Province of ChinaTajikistanTanzania, United Republic ofThailand, Kingdom ofTimor-Leste, Democratic Republic ofTogo, Togolese RepublicTokelau (Tokelau Islands)Tonga, Kingdom ofTrinidad and Tobago, Republic ofTunisia, Republic ofTurkey, Republic ofTurkmenistanTurks and Caicos IslandsTuvaluUganda, Republic ofUkraineUnited Arab EmiratesUnited Kingdom of Great Britain & N. IrelandUruguay, Eastern Republic ofUzbekistanVanuatuVenezuela, Bolivarian Republic ofViet Nam, Socialist Republic ofWallis and Futuna IslandsWestern SaharaYemenZambia, Republic ofZimbabwe What's your delivery address? Copy billing location Address City State AlabamaAlaskaArizonaArkansasCaliforniaColoradoConnecticutDelawareFloridaGeorgiaHawaiiIdahoIllinoisIndianaIowaKansasKentuckyLouisianaMaineMarylandMassachusettsMichiganMinnesotaMississippiMissouriMontanaNebraskaNevadaNew HampshireNew JerseyNew MexicoNew YorkNorth CarolinaNorth DakotaOhioOklahomaOregonPennsylvaniaRhode IslandSouth CarolinaSouth DakotaTennesseeTexasUtahVermontVirginiaWashingtonWashington D.C.West VirginiaWisconsinWyomingPuerto RicoUS Virgin IslandsArmed Forces AmericasArmed Forces PacificArmed Forces EuropeNorthern Mariana IslandsMarshall IslandsAmerican SamoaFederated States of MicronesiaGuamPalauAlberta, CanadaBritish Columbia, CanadaManitoba, CanadaNew Brunswick, CanadaNewfoundland, CanadaNova Scotia, CanadaNorthwest Territories, CanadaNunavut, CanadaOntario, CanadaPrince Edward Island, CanadaQuebec, CanadaSaskatchewan, CanadaYukon Territory, Canada Zip code Country United States of AmericaUS Virgin IslandsUnited States Minor Outlying IslandsCanadaMexico, United Mexican StatesBahamas, Commonwealth of theCuba, Republic ofDominican RepublicHaiti, Republic ofJamaicaAfghanistanAlbania, People's Socialist Republic ofAlgeria, People's Democratic Republic ofAmerican SamoaAndorra, Principality ofAngola, Republic ofAnguillaAntarctica (the territory South of 60 deg S)Antigua and BarbudaArgentina, Argentine RepublicArmeniaArubaAustralia, Commonwealth ofAustria, Republic ofAzerbaijan, Republic ofBahrain, Kingdom ofBangladesh, People's Republic ofBarbadosBelarusBelgium, Kingdom ofBelizeBenin, People's Republic ofBermudaBhutan, Kingdom ofBolivia, Republic ofBosnia and HerzegovinaBotswana, Republic ofBouvet Island (Bouvetoya)Brazil, Federative Republic ofBritish Indian Ocean Territory (Chagos Archipelago)British Virgin IslandsBrunei DarussalamBulgaria, People's Republic ofBurkina FasoBurundi, Republic ofCambodia, Kingdom ofCameroon, United Republic ofCape Verde, Republic ofCayman IslandsCentral African RepublicChad, Republic ofChile, Republic ofChina, People's Republic ofChristmas IslandCocos (Keeling) IslandsColombia, Republic ofComoros, Union of theCongo, Democratic Republic ofCongo, People's Republic ofCook IslandsCosta Rica, Republic ofCote D'Ivoire, Ivory Coast, Republic of theCyprus, Republic ofCzech RepublicDenmark, Kingdom ofDjibouti, Republic ofDominica, Commonwealth ofEcuador, Republic ofEgypt, Arab Republic ofEl Salvador, Republic ofEquatorial Guinea, Republic ofEritreaEstoniaEthiopiaFaeroe IslandsFalkland Islands (Malvinas)Fiji, Republic of the Fiji IslandsFinland, Republic ofFrance, French RepublicFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabon, Gabonese RepublicGambia, Republic of theGeorgiaGermanyGhana, Republic ofGibraltarGreece, Hellenic RepublicGreenlandGrenadaGuadaloupeGuamGuatemala, Republic ofGuinea, Revolutionary People's Rep'c ofGuinea-Bissau, Republic ofGuyana, Republic ofHeard and McDonald IslandsHoly See (Vatican City State)Honduras, Republic ofHong Kong, Special Administrative Region of ChinaHrvatska (Croatia)Hungary, Hungarian People's RepublicIceland, Republic ofIndia, Republic ofIndonesia, Republic ofIran, Islamic Republic ofIraq, Republic ofIrelandIsrael, State ofItaly, Italian RepublicJapanJordan, Hashemite Kingdom ofKazakhstan, Republic ofKenya, Republic ofKiribati, Republic ofKorea, Democratic People's Republic ofKorea, Republic ofKuwait, State ofKyrgyz RepublicLao People's Democratic RepublicLatviaLebanon, Lebanese RepublicLesotho, Kingdom ofLiberia, Republic ofLibyan Arab JamahiriyaLiechtenstein, Principality ofLithuaniaLuxembourg, Grand Duchy ofMacao, Special Administrative Region of ChinaMacedonia, the former Yugoslav Republic ofMadagascar, Republic ofMalawi, Republic ofMalaysiaMaldives, Republic ofMali, Republic ofMalta, Republic ofMarshall IslandsMartiniqueMauritania, Islamic Republic ofMauritiusMayotteMicronesia, Federated States ofMoldova, Republic ofMonaco, Principality ofMongolia, Mongolian People's RepublicMontserratMorocco, Kingdom ofMozambique, People's Republic ofMyanmarNamibiaNauru, Republic ofNepal, Kingdom ofNetherlands AntillesNetherlands, Kingdom of theNew CaledoniaNew ZealandNicaragua, Republic ofNiger, Republic of theNigeria, Federal Republic ofNiue, Republic ofNorfolk IslandNorthern Mariana IslandsNorway, Kingdom ofOman, Sultanate ofPakistan, Islamic Republic ofPalauPalestinian Territory, OccupiedPanama, Republic ofPapua New GuineaParaguay, Republic ofPeru, Republic ofPhilippines, Republic of thePitcairn IslandPoland, Polish People's RepublicPortugal, Portuguese RepublicPuerto RicoQatar, State ofReunionRomania, Socialist Republic ofRussian FederationRwanda, Rwandese RepublicSamoa, Independent State ofSan Marino, Republic ofSao Tome and Principe, Democratic Republic ofSaudi Arabia, Kingdom ofSenegal, Republic ofSerbia and MontenegroSeychelles, Republic ofSierra Leone, Republic ofSingapore, Republic ofSlovakia (Slovak Republic)SloveniaSolomon IslandsSomalia, Somali RepublicSouth Africa, Republic ofSouth Georgia and the South Sandwich IslandsSpain, Spanish StateSri Lanka, Democratic Socialist Republic ofSt. HelenaSt. Kitts and NevisSt. LuciaSt. Pierre and MiquelonSt. Vincent and the GrenadinesSudan, Democratic Republic of theSuriname, Republic ofSvalbard & Jan Mayen IslandsSwaziland, Kingdom ofSweden, Kingdom ofSwitzerland, Swiss ConfederationSyrian Arab RepublicTaiwan, Province of ChinaTajikistanTanzania, United Republic ofThailand, Kingdom ofTimor-Leste, Democratic Republic ofTogo, Togolese RepublicTokelau (Tokelau Islands)Tonga, Kingdom ofTrinidad and Tobago, Republic ofTunisia, Republic ofTurkey, Republic ofTurkmenistanTurks and Caicos IslandsTuvaluUganda, Republic ofUkraineUnited Arab EmiratesUnited Kingdom of Great Britain & N. IrelandUruguay, Eastern Republic ofUzbekistanVanuatuVenezuela, Bolivarian Republic ofViet Nam, Socialist Republic ofWallis and Futuna IslandsWestern SaharaYemenZambia, Republic ofZimbabwe Phone Subtotal: Total: How would you like to pay? Add New Card Name on card Credit card CVV Expiration Month Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec Expiration year 2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 2035 I Agree to the Subscription Terms of Use. This service will be automatically renewed and your credit card billed once it nears expiration. Secure transaction. Secure transaction. Cancel anytime. × You're all set! Thank you. Your gift purchase was successful! Your purchase was successful, and you are now logged in. A receipt was sent to your email. OK × An error occurred This offer is currently unavailable. Close",
        "topics": [
            "cuisine stouffer",
            "stouffer meals",
            "lean cuisine",
            "fry stouffer",
            "stouffer"
        ]
    },
    {
        "title": "Lean Cuisine and Stouffer's meals recalled for 'wood-like material' linked to choking",
        "url": "https://roanoke.com/news/nation-world/article_73790303-b6cd-5f3c-9669-2e5709e2b9e2.html",
        "content": "Please wait while we attempt to load the request page",
        "topics": [
            "load request",
            "request page",
            "attempt load",
            "load",
            "wait attempt"
        ]
    },
    {
        "title": "\"Misleading\": Nestle India Slams Fake Job Post Offering Rs 5-10 Lakh Salary",
        "url": "https://www.ndtv.com/feature/grossly-misleading-nestle-india-debunks-fake-job-post-offering-rs-5-10-lakh-salaries-7951011",
        "content": "\"Grossly Misleading\": Nestle India Debunks Fake Job Post Offering Rs 5-10 Lakh Salaries arrow-down comments printer search bell top-nav right-arrow NDTV World Profit हिंदी MOVIES IPL 2025 FOOD LIFESTYLE HEALTH TECH Games Big Bonus SHOPPING APPS Rajasthan MPCG Advertisement Live TV Latest India India All India News India GlobalDiasporaSouth Latest In Cash-At-Home Row, Delhi High Court Withdraws Judge From Active Duty Parliament Live Updates: Chaos In Rajya Sabha Over Minority Reservation Row BJP Leader, Cop Planned To Frame Cow Vigilantes? Audio Goes Viral Marriage Does Not Grant Husband Ownership Over His Wife: High Court On Comedian Kunal Kamra's Eknath Shinde Joke, Devendra Fadnavis' Reaction World Cities Metros BengaluruChennaiDelhiMumbai Other Cities AhmedabadAllahabadAmritsarBhopalBhubaneshwarChandigarhGhaziabadGoaGurgaonGuwahatiHyderabadJaipurKanpurKolkataLucknowNoidaPatnaPuneSrinagarThiruvananthapuram Opinion Videos Web Stories Auto Education Education ExamsSchool CampusStudy AbroadWeb Stories Latest Engineers India Limited Recruitment 2025: Registration Begins, No Written Test Required APSC Prelims 2025 Notification Released, Check Details IARI Recruitment 2025: Notification For Various Posts, Salary Up To Rs 67,000 RPF Constable Recruitment 2025: Answer Keys To Be Released Soon, Check Details IIT Delhi Invites Applications For MTech Admission, Check Eligibility Offbeat India@AI Web Stories Science Trends Photos Feature People TV Schedule Login Switch To Dark/Light Mode Trending Tags Latest News World News PNR Status Education News Business News Sports News MP Chhattisgarh News Rajasthan News Latest Mobile Phones Trending Committed To Closer Ties With India, Says Justin Trudeau Amid Row In Avoiding Repeat Of Telangana, BJP Pays Price In Tamil Nadu Man Complains Of Stomach Pain For Years, Doctors Find This Inside His Body \"They Can Speak For...\": US On India's Response On Canada's Allegations \"Grossly Misleading\": Nestle India Debunks Fake Job Post Offering Rs 5-10 Lakh Salaries facebook twitter WhatsApp comments Settings Change Font Size A A Focus on Story Edition INDIA World Search here Get App for Better Experience Get it on Google Play Download on the App Store News Updates Live TV India Latest Video Profit Movies Cricket News Updates Cities Elections Notifications Opinion Web Stories Trends Featured Feature Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Shopping Toolbox Follow Us On Facebook Twitter Instagram LinkedIn YouTube search olympic crypto_icon home Feature \"Grossly Misleading\": Nestle India Debunks Fake Job Post Offering Rs 5-10 Lakh Salaries \"Grossly Misleading\": Nestle India Debunks Fake Job Post Offering Rs 5-10 Lakh Salaries The scam advertises multiple positions with attractive salaries ranging from Rs 5 lakh to Rs 10 lakh per annum. Edited by: Ritu Singh Feature Mar 18, 2025 15:56 pm IST Published On Mar 18, 2025 15:26 pm IST Last Updated On Mar 18, 2025 15:56 pm IST Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email The fake job posting that caught Nestle India's attention was shared by a LinkedIn user named Pooja. Nestle India has issued a warning to job seekers about a recruitment scam that falsely promises employment opportunities with the company. The scam advertises multiple positions with attractive salaries ranging from ₹5 lakh to ₹10 lakh per annum. However, Nestle India's Chairman and Managing Director, Suresh Narayanan, has confirmed that these job postings are fake. He has cautioned \"young and aspiring talents\" to be vigilant and not respond to such fraudulent advertisements, which may appear as pop-ups or on fake websites.The fake job posting that caught Nestle India's attention was shared by a LinkedIn user named Pooja Dayal, who claims to be a recruitment specialist in her LinkedIn bio. \"Hi All, We are hiring for Multiple Positions in Nestle. Virtual Interview on 17th to 18th March 2025 | Timing:- 04:00 PM,\" she wrote. In response, Mr Narayanan called the advert ''fake\" and issued a statement. \"This advert for Nestle India 🇮🇳 jobs is completely fake, untrue and grossly misleading. Appealing to all young and aspiring talent NOT to respond to this or any advert that might pop up! As the CMD for Nestle India 🇮🇳, I don't want any youngster from anywhere to be duped by the lofty offers made! Hence please do not respond, and the reason I am personally intervening is my concern for you,\" Mr Narayanan wrote on LinkedIn.In response tp the job scam, Nestle India also clarified that it only recruits candidates through two official channels, either through direct recruitment through the company's website or partnering with reputable, authorized recruitment agencies in the industry.See the full post here:\"Nestle India recruits candidates either directly or through duly authorized reputed recruitment agencies in the industry. Our recruitment agencies do not charge any amount from the candidates either before or after the completion of the recruitment process. We request aspiring candidates to be cautious as Nestle India does not authorize any recruitment agency to directly issue an 'Offer Letter' for employment,\" the company wrote in a post on LinkedIn. Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Nestle India Job, Suresh Narayanan, Fake Job Posting Related News Racial Stereotype Charges Unfortunate: Nestle India On Cerelac Row Expect FMCG Industry To Rebound In Second Half Of 2016-17: Nestle India Nestle Relaunches Maggi In Atta, Oats Variants Trending News On Comedian Kunal Kamra's Eknath Shinde Joke, Devendra Fadnavis' Reaction \"She Filed Fake Rape Case\": Chennai Techie Accuses Wife Of Harassment \"Targeted Every Time...\": Mumbai Studio Shuts Down After Shiv Sena Rampage MS Dhoni's 0.12 Second Act Stumps Cricket World, Not Just Suryakumar Yadav Meerut Killers Muskaan, Sahil Made A Mistake That Cost Them Heavily Advertisement Advertisement Advertisement Quick Links Latest News PNR Status Education News Business News Sports News MP Chhattisgarh News NDTV Profit Marathi News Bihar Board 10th Results 2025 Bihar Board 12th Results 2025 Board Exam Results 2025 Russia Ukraine War Meerut Murder News Shiv Sena Workers Vandalise Kunal Kamra Row World TB Day 2025 Advertisement Follow us on facebook twitter instagram linkedin youtube whatsapp threads snapchat About Us Advertise EPG Services Channels Disclaimer Feedback Investors Redressals Privacy Policy Terms & Conditions Partner Content Archives NDTV Group Sites News Hindi Business Movies Cricket Food Tech Education Health Lifestyle MPCG Rajasthan Marathi This website follows the DNPA Code of Ethics © Copyright NDTV Convergence Limited 2025. All rights reserved. Edition INDIA World Search for News, Photos and Videos Get App for Better Experience Get it on Google Play Download on the App Store Get App for Better Experience Install Now News Updates Live TV India Latest Video Profit Movies Cricket Cities Featured Elections Notifications Opinion Web Stories Trends Feature More Links Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Shopping Toolbox Follow Us On Facebook Twitter Instagram Linkedin Youtube Whatsapp Threads Snapchat arrow-down search search olympic crypto_icon arrow-rgt arrow-next arrow-up close reddit-fill facebook-fill whatsapp-fill cog left-arrow snapchat-fill astrology-icn",
        "topics": [
            "india job",
            "india jobs",
            "india debunks",
            "india news",
            "india recruits"
        ]
    }
]