[
    {
        "title": "Microsoft announces security AI agents to help overwhelmed humans - The Verge",
        "url": "https://slashdot.org/firehose.pl?op=view&amp;id=176804215",
        "content": "Microsoft announces security AI agents to help overwhelmed humans - The Verge - Slashdot Slashdot Stories Firehose All Popular Polls Software Thought Leadership Submit Search Slashdot Login or Sign up Topics: Devices Build Entertainment Technology Open Source Science YRO Follow us: RSS Facebook LinkedIn Twitter Youtube Mastodon BlueskyBluesky Slashdot is powered by your submissions, so send in your scoop Nickname: Password: Public Terminal Forgot your password? Close binspamdupenotthebestofftopicslownewsdaystalestupid freshfunnyinsightfulinterestingmaybe offtopicflamebaittrollredundantoverrated insightfulinterestinginformativefunnyunderrated descriptive typodupeerror Is your data leaked on the dark web?Scan now for free with SOCRadar, no login required. × 176804215 feed Feed Google News Sci Tech: Microsoft announces security AI agents to help overwhelmed humans - The Verge (google.com) From feed by feedfeeder on Monday March 24, 2025 @03:14PM Microsoft announces security AI agents to help overwhelmed humansThe Verge Microsoft unveils Microsoft Security Copilot agents and new protections for AIMicrosoft Microsoft deploys AI agents for cybersecurityAxios Microsoft looks to AI to close window on hackersSky News AI agents swarm Microsoft Security CopilotThe Register This discussion was created for logged-in users only. Microsoft announces security AI agents to help overwhelmed humans - The Verge More | Reply Login Microsoft announces security AI agents to help overwhelmed humans - The Verge Post Load All Comments Full Abbreviated Hidden /Sea Score: 5 4 3 2 1 0 -1 More | Reply Login Nickname: Password: Public Terminal Forgot your password? Close Close Search 0 Comments Log In/Create an Account Comments Filter: All Insightful Informative Interesting Funny The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way. There may be more comments in this discussion. Without JavaScript enabled, you might want to turn on Classic Discussion System in your preferences instead. Slashdot Top Deals Slashdot Must Log in to Post Moderate Moderator Help Delete Get more comments Submit Story Friction is a drag. FAQ Story Archive Hall of Fame Advertising Terms Privacy Statement About Feedback Mobile View Blog Do Not Sell or Share My Personal Information Copyright © 2025 Slashdot Media. All Rights Reserved. × Close Close Slashdot Working...",
        "topics": [
            "security ai",
            "cybersecurityaxios microsoft",
            "microsoft security",
            "agents cybersecurityaxios",
            "ai agents"
        ]
    },
    {
        "title": "Microsoft unveils Microsoft Security Copilot agents and new protections for AI | Microsoft Security Blog",
        "url": "https://www.microsoft.com/en-us/security/blog/2025/03/24/microsoft-unveils-microsoft-security-copilot-agents-and-new-protections-for-ai/",
        "content": "Microsoft unveils Microsoft Security Copilot agents and new protections for AI | Microsoft Security Blog Skip to main content Microsoft Microsoft Security Microsoft Security Microsoft Security Home Solutions AI-powered cybersecurity Cloud security Data security Identity & network access Privacy & risk management Security for AI Unified SecOps Zero Trust Products Product families Product families Microsoft Defender Microsoft Entra Microsoft Intune Microsoft Priva Microsoft Purview Microsoft Sentinel Security AI Security AI Microsoft Security Copilot Identity & access Identity & access Microsoft Entra ID (Azure Active Directory) Microsoft Entra External ID Microsoft Entra ID Governance Microsoft Entra ID Protection Microsoft Entra Internet Access Microsoft Entra Private Access Microsoft Entra Permissions Management Microsoft Entra Verified ID Microsoft Entra Workload ID Microsoft Entra Domain Services Azure Key Vault SIEM & XDR SIEM & XDR Microsoft Sentinel Microsoft Defender for Cloud Microsoft Defender XDR Microsoft Defender for Endpoint Microsoft Defender for Office 365 Microsoft Defender for Identity Microsoft Defender for Cloud Apps Microsoft Security Exposure Management Microsoft Defender Vulnerability Management Microsoft Defender Threat Intelligence Cloud security Cloud security Microsoft Defender for Cloud Microsoft Defender Cloud Security Posture Mgmt Microsoft Defender External Attack Surface Management Azure Firewall Azure Web App Firewall Azure DDoS Protection GitHub Advanced Security Endpoint security & management Endpoint security & management Microsoft Defender for Endpoint Microsoft Defender XDR Microsoft Defender for Business Microsoft Intune core capabilities Microsoft Defender for IoT Microsoft Defender Vulnerability Management Microsoft Intune Advanced Analytics Microsoft Intune Endpoint Privilege Management​ Microsoft Intune Enterprise Application Management Microsoft Intune Remote Help Microsoft Cloud PKI Compliance & privacy Compliance & privacy Microsoft Purview Communication Compliance Microsoft Purview Compliance Manager Microsoft Purview Data Lifecycle Management Microsoft Purview eDiscovery Microsoft Purview Audit Microsoft Priva Risk Management Microsoft Priva Subject Rights Requests Data security & governance Data security & governance Microsoft Purview Information Protection Microsoft Purview Insider Risk Management Microsoft Purview Data Loss Prevention Microsoft Purview Data Governance Services Microsoft Security Experts Microsoft Defender Experts for XDR Microsoft Defender Experts for Hunting Microsoft Incident Response Microsoft Security Enterprise Services Partners Resources Get started Get started Cybersecurity awareness Customer stories Security 101 Product trials How we protect Microsoft Reports and analysis Reports and analysis Industry recognition Microsoft Security Insider Microsoft Digital Defense Report Security Response Center Community Community Microsoft Security Blog Microsoft Security Events Microsoft Tech Community Documentation and training Documentation and training Documentation Technical Content Library Training & certifications Additional sites Additional sites Compliance Program for Microsoft Cloud Microsoft Trust Center Security Engineering Portal Service Trust Portal Microsoft Secure Future Initiative Business Solutions Hub Contact Sales Start free trial More All Microsoft Global Microsoft Security Azure Dynamics 365 Microsoft 365 Microsoft Teams Windows 365 Tech & innovation Tech & innovation Microsoft Cloud AI Azure Space Mixed reality Microsoft HoloLens Microsoft Viva Quantum computing Sustainability Industries Industries Education Automotive Financial services Government Healthcare Manufacturing Retail All industries Partners Partners Find a partner Become a partner Partner Network Azure Marketplace AppSource Resources Resources Blog Microsoft Advertising Developer Center Documentation Events Licensing Microsoft Learn Microsoft Research View Sitemap Search Search Microsoft Security No results Cancel Blog home AI and machine learning Search the Microsoft security blog Submit Events AI and machine learning Microsoft Security Copilot 7 min read Microsoft unveils Microsoft Security Copilot agents and new protections for AI By Vasu Jakkal, Corporate Vice President, Microsoft Security March 24, 2025 News Microsoft Defender Microsoft Entra Microsoft Purview Listen to this post / 1x Powered by Azure In this age of AI, securing AI and using it to boost security are crucial for every organization. At Microsoft, we are dedicated to helping organizations secure their future with our AI-first, end-to-end security platform. One year ago, we launched Microsoft Security Copilot to empower defenders to detect, investigate, and respond to security incidents swiftly and accurately. Now, we are excited to announce the next evolution of Security Copilot with AI agents designed to autonomously assist with critical areas such as phishing, data security, and identity management. The relentless pace and complexity of cyberattacks have surpassed human capacity and establishing AI agents is a necessity for modern security. For example, phishing attacks remain one of the most common and damaging cyberthreats. Between January and December 2024, Microsoft detected more than 30 billion phishing emails targeting customers.1 The volume of these cyberattacks overwhelms security teams relying on manual processes and fragmented defenses, making it difficult to both triage malicious messages promptly and leverage data-driven insights for broader cyber risk management. The phishing triage agent in Microsoft Security Copilot being unveiled today can handle routine phishing alerts and cyberattacks, freeing up human defenders to focus on more complex cyberthreats and proactive security measures. This is just one way agents can transform security. Additionally, securing and governing AI continues to be the top priority for organizations, and we are excited to advance our purpose-built solutions with new innovations across Microsoft Defender, Microsoft Entra, and Microsoft Purview. Read on to learn about other agents we are introducing to Security Copilot and important developments in securing AI. Expanding Microsoft Security Copilot with AI agentic capabilities Microsoft Threat Intelligence now processes 84 trillion signals per day, revealing the exponential growth in cyberattacks, including 7,000 password attacks per second.1 Scaling cyber defenses through AI agents is now an imperative to keep pace with this threat landscape. We are expanding Security Copilot with six security agents built by Microsoft and five security agents built by our partners—available for preview in April 2025. Six new agentic solutions from Microsoft Security Building on the transformative capabilities of Security Copilot, the six Microsoft Security Copilot agents enable teams to autonomously handle high-volume security and IT tasks while seamlessly integrating with Microsoft Security solutions. Purpose-built for security, agents learn from feedback, adapt to workflows, and operate securely—aligned to Microsoft’s Zero Trust framework. With security teams fully in control, agents accelerate responses, prioritize risks, and drive efficiency to enable proactive protection and strengthen an organization’s security posture. Security Copilot agents will be available across the Microsoft end-to-end security platform, designed for the following: Phishing Triage Agent in Microsoft Defender triages phishing alerts with accuracy to identify real cyberthreats and false alarms. It provides easy-to-understand explanations for its decisions and improves detection based on admin feedback. Alert Triage Agents in Microsoft Purview triage data loss prevention and insider risk alerts, prioritize critical incidents, and continuously improve accuracy based on admin feedback. Conditional Access Optimization Agent in Microsoft Entra monitors for new users or apps not covered by existing policies, identifies necessary updates to close security gaps, and recommends quick fixes for identity teams to apply with a single click. Vulnerability Remediation Agent in Microsoft Intune monitors and prioritizes vulnerabilities and remediation tasks to address app and policy configuration issues and expedites Windows OS patches with admin approval. Threat Intelligence Briefing Agent in Security Copilot automatically curates relevant and timely threat intelligence based on an organization’s unique attributes and cyberthreat exposure. Security Copilot’s agentic capabilities are an example of how we continue to deliver innovation leveraging our decades of AI research. See how agents work. “This is just the beginning; our security AI research is pushing the boundaries of innovation, and we are eager to continuously bring even greater value to our customers at the speed of AI.” —Alexander Stojanovic, Vice President of Microsoft Security AI Applied Research Five new agentic solutions from Microsoft Security partners Security is a team sport and Microsoft is committed to empowering our security ecosystem with an open platform upon which partners can build to deliver value to customers. In this spirit, the following five AI agents from our partners will be available in Security Copilot: Privacy Breach Response Agent by OneTrust analyzes data breaches to generate guidance for the privacy team on how to meet regulatory requirements. Network Supervisor Agent by Aviatrix performs root cause analysis and summarizes issues related to VPN, gateway, or Site2Cloud connection outages and failures. SecOps Tooling Agent by BlueVoyant assesses a security operations center (SOC) and state of controls to make recommendations that help optimize security operations and improve controls, efficacy, and compliance. Alert Triage Agent by Tanium provides analysts with the necessary context to quickly and confidently make decisions on each alert. Task Optimizer Agent by Fletch helps organizations forecast and prioritize the most critical cyberthreat alerts to reduce alert fatigue and improve security. “An agentic approach to privacy will be game-changing for the industry. Autonomous AI agents will help our customers scale, augment, and increase the effectiveness of their privacy operations. Built using Microsoft Security Copilot, the OneTrust Privacy Breach Response Agent demonstrates how privacy teams can analyze and meet increasingly complex regulatory requirements in a fraction of the time required historically.” —Blake Brannon, Chief Product and Strategy Officer, OneTrust Learn more about Security Copilot agents and get started with Security Copilot. Current Security Copilot customers can join our Customer Connection Program for the latest updates. New AI-powered data security investigations and analysis We are also announcing Microsoft Purview data security investigations to help data security teams quickly understand and mitigate risks associated with sensitive data exposure. Data security investigations introduce AI-powered deep content analysis, which identifies sensitive data and other risks linked to incidents. Incident investigators can use these insights to collaborate securely with partner teams and simplify complex and time-consuming tasks, thus improving mitigation. This solution links data security investigations to Defender incidents and Purview insider risk cases—available for preview starting April 2025. Further advances in securing and governing generative AI Successful AI transformation requires a strong cybersecurity foundation. As organizations rapidly adopt generative AI, there is growing urgency to secure and govern the creation, adoption, and use of AI in the workplace. According to our new report, “Secure employee access in the age of AI,” 57% of organizations report an increase in security incidents from AI usage. And while most organizations recognize the need for AI controls, 60% have not yet started. Securing AI is still a relatively new challenge, and leaders share some specific concerns: how to prevent data oversharing and leakage; how to minimize new AI threats and vulnerabilities; and how to comply with shifting regulatory compliance requirements. Microsoft Security solutions are purpose-built for AI to help every organization address these concerns. We’re announcing new advanced capabilities so that organizations can secure their AI investments—both Microsoft AI and other AI. AI security posture management for multimodel and multicloud environments Organizations developing their own custom AI solutions will need to strengthen the security posture for AI that they source from multiple models, running in multiple AI platforms and clouds. To address this need, Microsoft Defender has extended AI security posture management beyond Microsoft Azure and Amazon Web Services to include Google VertexAI and all models in the Azure AI Foundry model catalog. Available for preview in May 2025, this coverage includes Gemini, Gemma, Meta Llama, Mistral, and custom models. With new multicloud interoperability, organizations will gain broader code-to-runtime AI security posture visibility across Microsoft Azure, Amazon Web Services, and Google Cloud. Microsoft Defender can give organizations a jumpstart to securing AI posture across multimodel and multicloud environments. New detection and protection for emerging AI threats With AI comes new risks, including new cyberattack surfaces and unknown vulnerabilities. The Open Worldwide Application Security Project (OWASP) identifies the highest priority risks and mitigations for generative AI apps. Starting in May 2025, new and enriched AI detections for several risks identified by OWASP such as indirect prompt injection attacks, sensitive data exposure, and wallet abuse will be generally available in Microsoft Defender. With these new detections, SOC analysts can better protect and defend custom-built AI apps with new safeguards for Azure OpenAI Service and models found in the Azure AI Foundry catalog. New controls to prevent risky access and data leaks into shadow AI apps With the rapid user adoption of generative AI, many organizations are uncovering widespread use of AI apps that have not yet been approved by IT or security teams. This unsanctioned, unprotected use of AI has created a “shadow AI” phenomenon, which has drastically increased the risk of sensitive data leakage. We are announcing general availability of AI web category filter in Microsoft Entra internet access to help enforce granular access controls that can curb the risk of shadow AI by enforcing policies governing which users and groups have access to different types of AI applications. With policy enforcement in place to govern authorized access to AI apps, the next layer of defense is to prevent users from leaking sensitive data into AI apps. To address this, we are announcing the preview of Microsoft Purview browser data loss prevention (DLP) controls built into Microsoft Edge for Business. This helps security teams enforce DLP policies to prevent sensitive data from being typed into generative AI apps, starting with ChatGPT, Copilot Chat, DeepSeek, and Google Gemini. Learn more about our new innovations in Security for AI. New phishing protection in Microsoft Teams for safer collaboration While email continues to be the primary cyberthreat vector for phishing, collaboration software has become a common target. Generally available in April 2025, Microsoft Defender for Office 365 will protect users against phishing and other advanced cyberthreats within Teams. With inline protection, Teams will have better protection against malicious URLs, including real-time detonation of attachments and links. And to give SOC teams full visibility into related attempts and incidents, alerts and data will be available in Microsoft Defender. Agile innovation to build a safer world We continue to innovate across the Microsoft Security portfolio, applying the principles of our Secure Future Initiative, to deliver powerful, end-to-end protection to give defenders industry-leading AI, and to empower every organization with the tools to secure and govern AI. We are grateful for our customers and partners and together, with them, we look forward to building a more secure world for all. Microsoft Secure To see these innovations in action, join us on April 9, 2025 for Microsoft Secure, a digital event focused on security in the age of AI. Register now Learn with Microsoft Security To learn more about Microsoft Security solutions, visit our website. Bookmark the Security blog to keep up with our expert coverage on security matters. Also, follow us on LinkedIn (Microsoft Security) and X (@MSFTSecurity) for the latest news and updates on cybersecurity. 1Based on Microsoft internal data. Get started with Microsoft Security Microsoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place. Learn more Connect with us on social What's new Surface Pro Surface Laptop Surface Laptop Studio 2 Surface Laptop Go 3 Microsoft Copilot AI in Windows Explore Microsoft products Windows 11 apps Microsoft Store Account profile Download Center Microsoft Store support Returns Order tracking Certified Refurbished Microsoft Store Promise Flexible Payments Education Microsoft in education Devices for education Microsoft Teams for Education Microsoft 365 Education How to buy for your school Educator training and development Deals for students and parents Azure for students Business Microsoft Cloud Microsoft Security Dynamics 365 Microsoft 365 Microsoft Power Platform Microsoft Teams Microsoft 365 Copilot Small Business Developer & IT Azure Microsoft Developer Microsoft Learn Explore ISV Success Microsoft Tech Community Azure Marketplace AppSource Visual Studio Company Careers About Microsoft Company news Privacy at Microsoft Investors Diversity and inclusion Accessibility Sustainability English (United States) Your Privacy Choices Opt-Out Icon Your Privacy Choices Your Privacy Choices Opt-Out Icon Your Privacy Choices Consumer Health Privacy Sitemap Contact Microsoft Privacy Manage cookies Terms of use Trademarks Safety & eco Recycling About our ads © Microsoft 2025",
        "topics": [
            "security microsoft",
            "defender microsoft",
            "cybersecurity cloud",
            "microsoft security",
            "security cloud"
        ]
    },
    {
        "title": "Microsoft Teams Unveils Slide Control Sharing",
        "url": "https://www.webpronews.com/microsoft-teams-unveils-slide-control-sharing/",
        "content": "Microsoft Teams Unveils Slide Control Sharing WebProNews Advertise with Us Advertising & Marketing AdvertisingDay AnalyticsPro AppProductPro B2BMarketingTrends BrandBuildingPro CDOUpdate CDPTrends CMOTrends CMSPro ContentMarketingNews CRMNews CROTrends DAMPro DataDrivenMarketingPro DemandGenPro DigitalAgencyPro DigitalExperiencePro DigitalMarketingNews DigitalTransformationTrends EmailMarketingToday EnterpriseCRMNews EnterpriseMarketingNews EnterpriseSalesNews FullStackMarketerNews InfluencerMarketingPro MarketingAI MarketingNews MarketingStrategiesPro MediaTransformationUpdate MOPSPro OmniChannelMarketer PaidSearchPro PodcastingPro ProgrammaticAdvertisingPro PublicRelationsPro RevOpsPro SalesNews SearchNews SEMProNews SEOProNews SocialMediaNews UGCTrends VideoMarketingPro Business AccountingToday AutomotivePro BizDevUpdate BusinessCommunicationTrends CallCenterPro CAOTrends CEOTrends CFOTrends CloudWorkPro CMSPro COOUpdate CPOTrends CustomerExperienceNews DigitalWorkplaceTrends EmployeeExperiencePro ENTBusinessNews EnterpriseWebPro FinancePro HRProNews InsideOffice InternalCommsPro LocalSearchPro PayrollPro ProcurementPro ProductManagementPro RemoteWorkingTrends RiskManagementPro SAASPro SalesEnablementTrends SalesTechPro SmallBusinessNews SmallBusinessUpdate SmallSiteNews SmallWebBusiness WebProBusiness WebsiteNotes Developer AIDeveloper AppDevNews DesignNews DevNews DevOpsUpdate DevSecurityPro DevWebPro KubernetesPro MobileDevPro ObservabilityTrends SoftwareEngineerNews Emerging Tech 5GRevolution AutoRevolution AITrends ChinaRevolutionUpdate CloudRevolutionUpdate CompliancePro CryptocurrencyPro EdgeComputingPro EdTechUpdate ElectricVehicleTrends EmergingTechUpdate FinTechUpdate GenAIPro HealthRevolution HealthcareITPro HiTechEdge IoTUpdate MachineLearningPro MobilityRevolutionUpdate RideShareRevolution RobotRevolutionPro SpaceRevolution TransportationRevolution VirtualRealityTrends IT Management BigDataPro CDOPro CIOProNews CISOUpdate CloudPlatformPro CloudSecurityUpdate CTOUpdate CybersecurityUpdate DataAnalystPro DatabaseProNews DevSecOpsPro EnterpriseITPro EnterpriseSecurity InfoSecPro ITManagementNews ITProNews LowCodeUpdate MultiCloudPro NetworkingFiles NetworkNews SecurityProNews SysAdminNews Retail & eCommerce B2BeCommerce CPGTrends DigitalCommerceNews DTCProNews EcommerceMarketing EcommerceTrends eCommNews EnterpriseCustomer EnterpriseECommerce FutureRetailNews LogisticsPro ManufacturingPro MarketplaceCommerce MobileCommercePro PaymentTrends RestaurantRevolution RetailConvergence RetailMarketingPro RetailPro RetailRevolution SharingEconomyTrends SubscriptionEconomyPro SupplyChainPro Browse Categories Advertising & Marketing Business Developer Emerging Tech IT Management Retail & eCommerce Home Contact Us Privacy Policy Advertise With Us Newsletter Signup Request Media Kit BusinessCommunicationTrends Microsoft Teams Unveils Slide Control Sharing Microsoft is adding an important feature in an update to Teams, giving presenters the ability to share control of slides.... Microsoft Teams Unveils Slide Control Sharing Written by Matt Milano Monday, March 24, 2025 Microsoft is adding an important feature in an update to Teams, giving presenters the ability to share control of slides. Teams is one of the industry’s leading application for business chat and communication, long since surpassing Slack and increasing challenging Zoom for the top spot. Much like its rivals, Teams offers videoconferencing options, but it has had a noticeable omission: the ability to have multiple users share control over slides. In a recent Microsoft 365 Roadmap update, the company announced it is finally bringing this feature to Teams. Meeting or event presenters can now share control of slides with fellow presenters eliminating manual slide changes and maintaining a smooth flow during meetings or webinars. The addition should make it much easier for presenters to control their presentations, and brings Teams one step closer to parity with its rivals. Recent Articles SAP Is Now’s Europe’s Most Valuable Company Tuesday, March 25, 2025 How to Recover Deleted Files from NAS (Synology/QNAP) Tuesday, March 25, 2025 4 Creative Ways to Promote Your Summer Product Lines Tuesday, March 25, 2025 Get the WebProNews newsletter delivered to your inbox Get the free daily newsletter read by decision makers Subscribe Advertise with Us Ready to get started? Get our media kit Advertise with Us About Us WebProNews is a leading publisher of business and technology email newsletters and websites. Contact Us Reach our audience Advertising Client Library Newsletter Signup Publication Categories Advertising & MarketingBusinessDeveloperRetail & eCommerceEmerging TechLifeIT Management Advertise With Us Deliver your marketing message directly to decision makers. Get Started WebProNews is an iEntry Publication ©2025 iEntry, Inc. All rights reserved. Privacy Policy | Legal | Contact Us | [forminator_form id=\"2543\"]",
        "topics": [
            "microsoft teams",
            "teams industry",
            "customerexperiencenews digitalworkplacetrends",
            "enterprisemarketingnews",
            "enterprisemarketingnews enterprisesalesnews"
        ]
    },
    {
        "title": "Key trusted Microsoft platform exploited to enable malware, experts warn",
        "url": "https://www.techradar.com/pro/security/key-trusted-microsoft-platform-exploited-to-enable-malware-experts-warn",
        "content": "Key trusted Microsoft platform exploited to enable malware, experts warn | TechRadar Skip to main content Tech Radar Tech Radar Pro Tech Radar Gaming Open menu Close menu Tech Radar Pro TechRadar the business technology experts Search Search TechRadar Sign in View Profile Sign out RSS UK EditionASIASingaporeEUROPEDanmarkSuomiNorgeSverigeUKItaliaNederlandBelgië (Nederlands)FranceDeutschlandEspañaNORTH AMERICAUS (English)CanadaMéxicoAustralasiaAustraliaNew Zealand News Reviews Features Expert Insights Website builders Web hosting Security TrendingBest web hostingBest website builderBest office chairsExpert Insights Pro Security Key trusted Microsoft platform exploited to enable malware, experts warn News By Sead Fadilpašić published 24 March 2025 Microsoft Trusted Signing abused to grant malware short-lived certificates Comments ( 0 ) () When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. (Image credit: TR) Trusted Signing, a Microsoft certificate-signing service, is being abused by criminals, researchers are sayingThe criminals are signing malware with short-lived, three-day certificatesMicrosoft is actively monitoring for certificate abuseCybersecurity experts have warned Trusted Signing, Microsoft’s code-signing platform, is being abused to grant malware certificates and help it bypass endpoint protection and antivirus programs.Certificates are digital credentials that verify the authenticity, integrity, and security of software. They use cryptographic keys to establish secure communications and prevent tampering or impersonation, and are considered crucial for encrypting sensitive data, ensuring secure transactions, and maintaining user trust. In software development, code-signing certificates validate that an application has not been altered after release.Microsoft describes Trusted Signing as a, “fully managed, end-to-end signing solution that simplifies the certificate signing process and helps partner developers more easily build and distribute applications.” You may like Microsoft 365 accounts are under attack from new malware spoofing popular work apps Microsoft Teams and other Windows tools hijacked to hack corporate networks Lumma Stealer and othersHowever, BleepingComputer reports multiple researchers observing threat actors using Trusted Signing to sign their malware with “short-lived, three-day code-signing certificates”.Software signed this way will remain valid until the certificate is revoked, which suggests that the malware could successfully bypass security solutions for a lot longer.The malware samples they analyzed were signed by \"Microsoft ID Verified CS EOC CA 01,” it was said.Among the campaigns abusing Microsoft are Crazy Evil Traffers’ crypto heist, and Lumma Stealer.Are you a pro? Subscribe to our newsletterSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!Contact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.One of the ways Microsoft seems to be tackling this issue is to only allow certificates to be issued under the name of a company that’s been operational for at least three years.However, individuals can sign up and get faster approval, if the certificate is issued under their name.Microsoft says it is constantly monitoring the landscape and revoking certificates that were found to have been abused.\"When we detect threats we immediately mitigate with actions such as broad certificate revocation and account suspension. The malware samples you shared are detected by our antimalware products and we have already taken action to revoke the certificates and prevent further account abuse,” the company noted.You might also likeThis VPN is being abused to spread malwareWe've rounded up the best password managersTake a look at our guide to the best authenticator app TOPICS Malware Microsoft Sead FadilpašićSocial Links NavigationSead is a seasoned freelance journalist based in Sarajevo, Bosnia and Herzegovina. He writes about IT (cloud, IoT, 5G, VPN) and cybersecurity (ransomware, data breaches, laws and regulations). In his career, spanning more than a decade, he’s written for numerous media outlets, including Al Jazeera Balkans. He’s also held several modules on content writing for Represent Communications. You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name. Logout Read more Microsoft 365 accounts are under attack from new malware spoofing popular work apps Microsoft Teams and other Windows tools hijacked to hack corporate networks Huge cyberattack found hitting vulnerable Microsoft-signed legacy drivers to get past security Security experts are being targeted with fake malware discoveries Microsoft authentication system spoofed via phishing attack Fake CAPTCHAs are being used to spread malware - and we only have ourselves to blame Latest in Security Coinbase targeted after recent Github attacks Key trusted Microsoft platform exploited to enable malware, experts warn IBM to provide platform for flagship cyber skills programme for girls Oracle denies data breach after hacker claims to hold six million records North Korea unveils new military unit targeting AI attacks US government warns agencies to make sure their backups are safe from NAKIVO security issue Latest in News ChatGPT is down for many – here's what's going on Apple's AirPods Max with USB-C will get lossless audio in April, but you'll need to go wired It looks like Microsoft might have thought better about banishing Copilot AI shortcut from Windows 11 US government IT contracts set to be centralized in new Trump order Tesla is still taking deposits on its long overdue Roadster, despite promising it would arrive in 2020 Samsung promises to repair soundbars bricked by its disastrous software update for free – but it'll probably involve shipping More about security Coinbase targeted after recent Github attacks Oracle denies data breach after hacker claims to hold six million records Latest Indiana Jones and the Great Circle finally gets PS5 release date and I can't wait to don the fedora and crack the whip See more latest Most Popular Indiana Jones and the Great Circle finally gets PS5 release date and I can't wait to don the fedora and crack the whip NYT Strands hints and answers for Tuesday, March 25 (game #387) NYT Connections hints and answers for Tuesday, March 25 (game #653) Quordle hints and answers for Tuesday, March 25 (game #1156) Apple's AirPods Max with USB-C will get lossless audio in April, but you'll need to go wired US government IT contracts set to be centralized in new Trump order ChatGPT is down for many – here's what's going on It looks like Microsoft might have thought better about banishing Copilot AI shortcut from Windows 11 Coinbase targeted after recent Github attacks Amazon warns customers about the Surface Laptop – and it’s not just bad news for Microsoft LATEST ARTICLES1Key trusted Microsoft platform exploited to enable malware, experts warn2Indiana Jones and the Great Circle finally gets PS5 release date and I can't wait to don the fedora and crack the whip3I got absolutely destroyed by The First Berserker: Khazan’s bosses for hours on end and loved every second of it4NYT Strands hints and answers for Tuesday, March 25 (game #387)5Quordle hints and answers for Tuesday, March 25 (game #1156) TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. About Us Contact Future's experts Contact Us Terms and conditions Privacy policy Cookies policy Advertise with us Web notifications Accessibility Statement Careers © Future Publishing Limited Quay House, The Ambury, Bath BA1 1UA. All rights reserved. England and Wales company registration number 2008885. Close Please login or signup to comment Please wait... Login Sign Up",
        "topics": [
            "malware certificates",
            "trusted microsoft",
            "microsoft trusted",
            "signing malware",
            "microsoft certificate"
        ]
    },
    {
        "title": "Microsoft announces security AI agents to help overwhelmed humans",
        "url": "https://www.theverge.com/news/634598/microsoft-security-copilot-ai-agents",
        "content": "Microsoft announces security AI agents to help overwhelmed humans | The VergeSkip to main contentThe homepageThe VergeThe Verge logo.The VergeThe Verge logo.TechReviewsScienceEntertainmentAIMoreExpandThe homepageThe VergeThe Verge logo.MenuExpandNavigation DrawerThe VergeThe Verge logo.Login / Sign UpcloseCloseSearchTechExpandAll TechAmazonAppleFacebookGoogleMicrosoftSamsungBusinessCreatorsMobilePolicySecurityTransportationReviewsExpandAll ReviewsBuying GuidesDealsGift GuideLaptopsPhonesHeadphonesTabletsSmart HomeSmartwatchesSpeakersDronesScienceExpandAll ScienceSpaceEnergyEnvironmentHealthCOVID-19EntertainmentExpandAll EntertainmentGamesTV ShowsMoviesAudioAICarsExpandAll CarsElectric CarsAutonomous CarsRide-SharingScootersOther TransportationFeaturesVideosExpandAll VideosYouTubeTikTokInstagramPodcastsExpandAll PodcastsDecoderThe VergecastNewslettersExpandAll NewslettersCommand LineInstallerNotepadVerge DealsStoreSubscribeFacebookThreadsInstagramYoutubeRSSThe VergeThe Verge logo.Microsoft announces security AI agents to help overwhelmed humansComments DrawerNewsMicrosoft announces security AI agents to help overwhelmed humansMicrosoft has six new security agents that can do things like process phishing and data loss alerts.Microsoft has six new security agents that can do things like process phishing and data loss alerts.by Tom WarrenMar 24, 2025, 4:00 PM UTCLinkFacebookThreadsImage: Cath Virginia / The VergeTom Warren is a senior editor and author of Notepad, who has been covering all things Microsoft, PC, and tech for over 20 years.Microsoft launched its AI-powered Security Copilot a year ago to bring a chatbot to the cybersecurity space, and now it’s expanding it with AI agents that are designed to autonomously assist overwhelmed security teams. Microsoft is unveiling six of its own AI agents for its Security Copilot, as well as five that have been created by its partners.Microsoft’s six security agents will be available in preview next month, and are designed to do things like triage and process phishing and data loss alerts, prioritize critical incidents, and monitor for vulnerabilities. “The six Microsoft Security Copilot agents enable teams to autonomously handle high-volume security and IT tasks while seamlessly integrating with Microsoft Security solutions,“ says Vasu Jakkal, corporate vice president of Microsoft Security.Microsoft is also working with OneTrust, Aviatrix, BlueVoyant, Tanium, and Fletch to enable some third-party security agents. These extensions will make it easier to analyze data breaches with OneTrust or perform root cause analysis of network outages and failures with Aviatrix.AI agents are becoming an increasingly popular way for companies like Microsoft to sell businesses on AI tools. Microsoft relaunched its Copilot for businesses earlier this year with free AI chat and access to pay-as-you-go AI agents.While these latest AI agents in the Security Copilot are designed for security teams to take advantage of, Microsoft is also improving its phishing protection in Microsoft Teams. Microsoft Defender for Office 365 will start protecting Teams users against phishing and other cyberthreats within Teams next month, including better protection against malicious URLs and attachments.Microsoft also has a lot of other industry-specific security announcements today and at its upcoming Microsoft Secure event on April 9th. You can read more about them over at Microsoft’s security blog.See More: MicrosoftNewsTechMost PopularMost PopularIs it safe to travel with your phone right now?How to delete your 23andMe dataX’s head of engineering is outOpenAI reshuffles leadership as Sam Altman pivots to technical focusThe Bambu H2D isn’t just a bigger 3D printer — it’s a laser cutter, pen plotter, and Cricut competitor tooInstallerA weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe.Email (required)Sign UpBy submitting your email, you agree to our Terms and Privacy Notice. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.Advertiser Content FromThis is the title for the native adMore in NewsSamsung’s 3D Odyssey monitor is now available to reserve, and it might cost $2,000Apple’s WWDC 2025 event starts June 9thDiscord’s refreshed UI includes a new overlay and full dark modeInstagram is giving schools a faster way to get students’ posts taken downSony brings more premium features to its budget wireless earbudsThe Trump administration axes funding for climate impacts on health researchSamsung’s 3D Odyssey monitor is now available to reserve, and it might cost $2,000Emma RothTwo hours agoCommentsComment Icon BubbleApple’s WWDC 2025 event starts June 9thJess WeatherbedTwo hours agoCommentsComment Icon BubbleDiscord’s refreshed UI includes a new overlay and full dark modeTom WarrenTwo hours agoCommentsComment Icon BubbleInstagram is giving schools a faster way to get students’ posts taken downEmma Roth4:00 PM UTCCommentsComment Icon BubbleSony brings more premium features to its budget wireless earbudsAndrew Liszewski4:00 PM UTCCommentsComment Icon BubbleThe Trump administration axes funding for climate impacts on health researchJustine Calma3:53 PM UTCCommentsComment Icon BubbleAdvertiser Content FromThis is the title for the native adTop Stories2:00 PM UTCThe Bambu H2D isn’t just a bigger 3D printer — it’s a laser cutter, pen plotter, and Cricut competitor too1:36 PM UTCHow Roomba got stuck1:00 PM UTCOtter’s new AI agent can speak up in meetingsMar 24How to delete your 23andMe dataMar 24X’s head of engineering is outAn hour agoAmazon’s big spring sale is live, and here are the 60 best dealsThe VergeThe Verge logo.FacebookThreadsInstagramYoutubeRSSContactTip UsCommunity GuidelinesAboutEthics StatementHow We Rate and Review ProductsCookie SettingsTerms of UsePrivacy NoticeCookie PolicyLicensing FAQAccessibilityPlatform Status© 2025 Vox Media, LLC. All Rights Reserved",
        "topics": [
            "security microsoft",
            "microsoft security",
            "security ai",
            "alerts microsoft",
            "vergecastnewslettersexpandall"
        ]
    },
    {
        "title": "Microsoft to Launch New Security Copilot Agents Next Month",
        "url": "https://www.thurrott.com/a-i/318857/microsoft-to-launch-new-security-copilot-agents-next-month",
        "content": "Microsoft to Launch New Security Copilot Agents Next Month Upgrade to Premium Log In Home Windows 11 Windows 11 on Arm Copilot+ PC Windows 11 Field Guide (Premium) Programming Windows (Premium) Windows 10 Mobile Copilot+ PC Microsoft Surface Mac + macOS Chromebook + Chrome OS Laptop reviews + more hardware Android Google Pixel iPhone + iOS iPad + iPadOS Apple Vision Pro Cloud + AI A.I. Microsoft Copilot OpenAI Apple Intelligence Web browsers OneDrive Microsoft consumer services Google Microsoft 365 Microsoft Teams OneDrive Home Tech Digital media Smart home Wearables Apple Vision Pro Games PC gaming Xbox Series X Xbox Series S Sony PlayStation Nintendo Podcasts Windows Weekly Hands-On Windows First Ring Daily The Sams Report Paul What I Use Travel Paul’s articles Paul’s books Eternal Spring Mexico City Guidebook Windows 11 Field Guide Windows Everywhere Windows 10 Field Guide Premium From the Editor’s Desk Ask Paul What I Use Online accounts (2025) Tech Nostalgia Windows 11 Field Guide Software dev Modernizing .NETpad (2025) Modernizing .NETpad (2024) Programming Windows – History series Join Thurrott Premium Premium FAQ Forums Contact About Thurrott.com Upgrade to Premium BlogA.I.Microsoft CopilotPost Microsoft to Launch New Security Copilot Agents Next Month Laurent Giret Mar 24, 2025 1 Microsoft announced today new Security Copilot AI agents designed to help organizations address cybersecurity threats. The new AI agents follow the launch of Microsoft Security Copilot (previously known as “Microsoft Copilot for Security”) a year ago, which introduced a generative AI-powered security solution that integrates with other Microsoft security offerings and other products third-party security vendors. The new Security Copilot AI agents Microsoft is announcing today include six in-house agents and five created by the company’s security partners. “Purpose-built for security, agents learn from feedback, adapt to workflows, and operate securely—aligned to Microsoft’s Zero Trust framework,” explained Vasu Jakkal, Corporate Vice President, Microsoft Security. “With security teams fully in control, agents accelerate responses, prioritize risks, and drive efficiency to enable proactive protection and strengthen an organization’s security posture.”Windows Intelligence In Your InboxSign up for our new free newsletter to get three time-saving tips each Friday — and get free copies of Paul Thurrott's Windows 11 and Windows 10 Field Guides (normally $9.99) as a special welcome gift! \"*\" indicates required fields Email* EmailThis field is for validation purposes and should be left unchanged. Δ Microsoft’s own Security Copilot agents include Alert Triage agents in Microsoft Purview, a Phishing Triage agent in Microsoft Defender, a Conditional Access Optimization agent in Microsoft Entra, a Vulnerability Remediation agent in Microsoft Intune, and a Threat Intelligence Briefing agent in Security Copilot. The other agentic solutions from third-party security partners include a Privacy Breach Response agent by OneTrust, a Network Supervisor agent by Aviatrix, a SecOps Tooling agent by BlueVoyant, an Alert Triage agent by Tanium, and a Task Optimizer agent by Fletch These new Security Copilot agents will launch in preview next month for organizations already using Microsoft’s generative AI-powered security solution. You can learn more details about how these AI agentic capabilities work in this separate blog post. Lastly, Microsoft also announced today that it’s bringing new protections against phishing attacks in Microsoft Teams. Starting next month, the app will automatically protect users against malicious URLs and attachments. Teams will also make it possible for users to report suspicious messages, including from external users to their security teams. Tagged with Security Microsoft Copilot Share post Please check our Community Guidelines before commenting About author Laurent Giret Laurent is a Senior News Editor at Thurrott.com. He's been writing about the technology industry for almost 10 years, and his favorite topics to cover include Big Tech, media, and gaming. He also was the Editorial Manager of the Petri IT Knowledgebase from 2022 to 2023. View Articles Currently on ForumsVisit the forums Pretty please at least try DirectoryOpus Posted by pholder 1 comment Did Microsoft stop selling Intel based Surface Devices Posted by Simon 3 comments Book similar to Windows 11 Field Guide for Mac? Posted by Adam Bailey 1 comment Should I Buy Plex Pass Lifetime Before Increase? Posted by j5 9 comments PodcastsPodcast Hub First Ring Daily 1756: A Brief Interruption Aired on March 24, 2025 by Brad Sams with 0 Comments Hands-On Windows 132: AI Credits and Microsoft 365 Aired on March 21, 2025 by Paul Thurrott with 0 Comments Windows Weekly 924: No One Wants to be Plumbing Aired on March 20, 2025 by Paul Thurrott with 0 Comments Hands-On Windows 131: AI Credits in Windows 11 Aired on March 14, 2025 by Paul Thurrott with 0 Comments Join the crowd where the love of tech is real - become a Thurrott Premium Member today! Explore Premium Benefits Windows Intelligence In Your Inbox Sign up for our new free newsletter to get three time-saving tips each Friday \"*\" indicates required fields Email* CommentsThis field is for validation purposes and should be left unchanged. Δ © 2025 Thurrott LLC About Thurrott.com Contact help and support Email Paul RSS A Free Gift For You Get a completely free copy of Paul Thurrott’s knowledge-packed Windows 11 and Windows 10 Field Guides when you sign up for our new Windows Intelligence newsletter. Three fresh tips in your inbox each Friday: \"*\" indicates required fields Email* PhoneThis field is for validation purposes and should be left unchanged. Δ X",
        "topics": [
            "copilotpost microsoft",
            "microsoft copilot",
            "copilot pc",
            "microsoft copilotpost",
            "copilot previously"
        ]
    },
    {
        "title": "Two of my least favorite things about the Microsoft Store are about to get fixed",
        "url": "https://www.windowscentral.com/software-apps/windows-11/two-of-my-least-favorite-things-about-the-microsoft-store-are-about-to-get-fixed",
        "content": "Microsoft Store update tackles two major complaints | Windows Central Skip to main content Open menu Close menu Windows Central Search Search Windows Central Sign in View Profile Sign out RSS Windows 11 Copilot & AI How to Xbox & Gaming Reviews PC & Surface ⭐ Deals ⭐ Forums More Podcasts About Windows Central TrendingProject KennanBest AI PC in 2025Windows 10Copilot+ PCsLegion Go S Software Apps Windows 11 Two of my least favorite things about the Microsoft Store are about to get fixed News By Sean Endicott published 24 March 2025 Microsoft is making over 150 changes to the Microsoft Store based on user feedback. Comments ( 0 ) () When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Themes within the Microsoft Store will soon be organized within their own section, which should be a vast improvement to the current layout. (Image credit: Future) Microsoft developers have been hard at work monitoring social media to receive feedback about the Microsoft Store. Rudy Huyn, principal lead architect of the Microsoft Store, took to X to share some of the changes made following feedback.In total, Microsoft has made over 150 client-side changes, according to Huyn.When Microsoft announced the end of its free wallpapers and themes website, I complained about how themes were organized in the Microsoft Store. It seems I was not alone, since Microsoft has created a brand-new page for browsing themes.Other changes include downloads now appearing separately from the My Library section of the Microsoft Store.Gamers also received some love, as it's now possible to select game components before installing a game.Downloading specific components was a nightmare when I compared the Microsoft Store to Steam. I'm happy to see some changes to improve the experience.New server modules, a new spotlight for home pages, and an AI Hub for Copilot+ PCs round out an impressive list of changes from Microsoft.Get the Windows Central NewsletterAll the latest news, reviews, and guides for Windows and Xbox diehards.Contact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.Huyn promised in his final post that more changes are coming.We closely follow your tweets and posts about the Microsoft Store and use your feedback to shape our plans for each sprint. In our latest release, we implemented over 150 client-side changes. Here’s a thread highlighting a few of them 🧵👇 (1/8)March 20, 2025The changes appear to be rolling out gradually, so you may not see them right away.Since threaded posts from X can be a bit difficult to navigate, here is what Huyn had to say about the improvements to the Microsoft Store:We closely follow your tweets and posts about the Microsoft Store and use your feedback to shape our plans for each sprint. In our latest release, we implemented over 150 client-side changes.We heard your feedback about themes and the need for easier browsing. We've created a brand-new page to help you find the themes you love with ease!Some of you shared feedback about the header of our product pages, especially when no trailers were available. We listened and made significant improvements, here is a before/after.We also heard your feedback about updating your applications and have made some important changes. Downloads are now separate from My Library and will now allow you to update unpackaged applications!You mentioned that you wanted the ability to select game components before installing a game, and this is now possible!We have built/[improved] several new modules, including a beautiful new spotlight for home pages.We made the experience even better on Copilot+ PC with a new exclusive AI Hub showcasing all the latest AI features available for these computers.And way more:We have made significant improvements to launch and navigation performance.Enjoy access to the full Game Pass catalog, including games available through other launchers (http://Battle.net, Riot, etc.)We’re launching our partnership with Tencent in China, bringing you thousands of new apps and games! TOPICS Microsoft Store Categories Windows 11 Software Apps Sean EndicottSocial Links NavigationNews Writer and apps editorSean Endicott is a tech journalist at Windows Central, specializing in Windows, Microsoft software, AI, and PCs. He's covered major launches, from Windows 10 and 11 to the rise of AI tools like ChatGPT. Sean's journey began with the Lumia 740, leading to strong ties with app developers. Outside writing, he coaches American football, utilizing Microsoft services to manage his team. He studied broadcast journalism at Nottingham Trent University and is active on X @SeanEndicott_ and Threads @sean_endicott_. You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name. Logout LATEST ARTICLES1Where to buy MSI Claw 8 AI+ gaming handheld: Launch date and restock alerts2Xbox's Indiana Jones and the Great Circle is coming to PlayStation 5 in April3Microsoft will slow down this version of OneNote before finally terminating support later this year4Atomfall: Here are the locations of every Atomic Battery5DOJ demands divestiture of Chrome browser and sets sights on making Google sell Android — calls Google \"incompatible with free markets and freedom\" Windows Central is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. Terms and conditions Contact Future's experts Privacy policy Cookies policy Accessibility statement Careers Licensing About Us Newsletter Advertise with us Android Central iMore © Future Publishing Limited Quay House, The Ambury, Bath BA1 1UA. All rights reserved. England and Wales company registration number 2008885. Close Please login or signup to comment Please wait... Login Sign Up",
        "topics": [
            "microsoft announced",
            "improvements microsoft",
            "microsoft store",
            "changes microsoft",
            "store microsoft"
        ]
    },
    {
        "title": "Forget the iPad Pro, Amazon Slashes Prices on Microsoft’s Surface Pro for the Big Spring Sale",
        "url": "https://gizmodo.com/forget-the-ipad-pro-amazon-slashes-prices-on-microsofts-surface-pro-for-the-big-spring-sale-2000579773",
        "content": "Forget the iPad Pro, Amazon Slashes Prices on Microsoft's Surface Pro for the Big Spring Sale Skip to content Search Home Latest Tech Reviews Science io9 AI Video Deals Deals This article is part of Gizmodo Deals, produced separately from the editorial team. We may earn a commission when you buy through links on the site. Forget the iPad Pro, Amazon Slashes Prices on Microsoft’s Surface Pro for the Big Spring Sale Save $350 on the Microsoft Surface Pro touchscreen laptop for a limited time. By Joe Tilleli Published March 24, 2025 | Comments (4) | 𝕏 Copied! © Microsoft If you’re still working off of a piece of ten year old tech, it may be time to start looking for a replacement. The Microsoft Surface Pro laptop is a super versatile option that can fulfill a lot of the needs of pretty much anyone, be it you’re a student, small business owner, or just someone who wants to go online with something other than their phone. Right now, you can get the 2024 Microsoft Surface Pro laptop for a crazy $350 off: That’s a 25% discount that brings the price down from $1,399 to just $1,049. See at Amazon Exceptional Performance This Microsoft Surface Pro laptop boasts a Snapdragon X Elite 12-core processor, engineered for exceptional speed and performance. It surpasses the MacBook Air’s M3 chip in efficiency and ensures effortless productivity with AI applications, which I guess is a thing now. It comes with either 16GB of 32GB of memory (the one at $1,050 comes with 16GB of RAM), allowing for smooth performance across a diverse range of applications, whether your using them for school work, business or leisure. The storage options available include 256GB, 512GB, and 1TB so you’ll have plenty of space for files, photos, and more. Just like most new tech products of the last year or so, Microsoft totes this Surface as being built for the new era of AI. The laptop supports Copilot+, Microsoft’s foray into the AI space which offers generative art from text image prompts and an the ability to easily retrieve documents or web pages which honestly just sounds like what your search bar already does. Calls are supposedly enhanced with Copilot+, improving lighting, canceling noise, and blurring out distractions. Though all that was already supported, we’re all just giving it the AI label now for marketing reasons. The OLED display is nice and large at 13 inches across. It has a touchscreen so you can go back and forth between interfacing it like a tablet or using the mouse and keyboard like traditional laptop—great to have that versatility. There’s hardly any bezel at all so you really maximize your screen real estate while keeping the laptop compact. And the laptop itself is thin and lightweight, keeping it easy to bring back and forth from the classroom to the dorm room or from your home to a nearby coffee shop. Portability at its finest. The battery is reliable and long-lasting, able to keep your laptop running for up to 14 hours. See at Amazon Daily Newsletter Get the best tech, science, and culture news in your inbox daily. Select News from the future, delivered to your present. Select Please select your desired newsletters and submit your email to upgrade your inbox. Sign me up Leave this field empty if you're human: Latest news It’s Been 20 Years Since Star Wars Gave the Funniest Reason for General Grievous’ Cough Trump Officials Say Secret Group Chat Wasn’t Classified But Won’t Give Reporter Permission to Publish Info The Pentagon Sent Out a Warning Against Using Signal Right Before Yemen Group Chat Fiasco Why The Last of Us Season 2 Changes When We Learn About Abby Apple Has Announced the Dates for WWDC 2025 TVs That Look Like Picture Frames Are Getting More Popular (and Cheaper) Yes, The Ritual Is Yet Another Exorcism Movie—but This One Stars Dan Stevens and Al Pacino The Best Memes About Adding Reporters to Group Chats About Bombing Yemen Latest news It’s Been 20 Years Since Star Wars Gave the Funniest Reason for General Grievous’ Cough 3/25/2025, 4:15 pm Trump Officials Say Secret Group Chat Wasn’t Classified But Won’t Give Reporter Permission to Publish Info 3/25/2025, 3:46 pm The Pentagon Sent Out a Warning Against Using Signal Right Before Yemen Group Chat Fiasco 3/25/2025, 3:24 pm Why The Last of Us Season 2 Changes When We Learn About Abby 3/25/2025, 3:15 pm Latest Reviews Assassin’s Creed Shadows Shows Ubisoft Still Hasn’t Made Assassin’s Creed 3/18/2025, 1:00 pm The Atari Asteroids Watch Is So Beautiful, I Don’t Care How Poorly It Tells Time 3/14/2025, 7:00 am Apple MacBook Air M4 Review: Feeling Ever So Blue 3/11/2025, 9:00 am Apple Mac Studio Review: A Hefty Little Powerhouse 3/11/2025, 9:00 am 𝕏 Sitemap Edición ES Ausgabe DE Edição PT Edition FR Accessibility Privacy Policy Terms of Use Advertising Reprints & Permissions Your Privacy Choices Product reviews We may earn a commission when you buy through links on our sites. ©2025 GIZMODO USA LLC. All rights reserved. Download Hub Best VPN Best Free VPN Best Cheap VPN NordVPN Review ExpressVPN Review PIA Review ProtonVPN Review Surfshark Review Super Bowl 2025 US Open 2024 Best Cloud Storage Best Web Hosting About Gizmodo Mode Follow us 𝕏 Home Latest Tech Reviews Science io9 AI Video Deals How to Tip Gizmodo About Gizmodo Download Hub Best VPN Best Free VPN Best Cheap VPN NordVPN Review ExpressVPN Review PIA Review ProtonVPN Review Surfshark Review Super Bowl 2025 US Open 2024 Best Cloud Storage Best Web Hosting About Gizmodo Mode Follow us 𝕏 Cookies settings",
        "topics": [
            "surface pro",
            "microsoft surface",
            "pro touchscreen",
            "ipad pro",
            "touchscreen laptop"
        ]
    },
    {
        "title": "Microsoft looks to AI to close window on hackers",
        "url": "https://news.sky.com/story/microsoft-looks-to-ai-to-close-window-on-hackers-13335086",
        "content": "Hacking by criminals and spies has reached 'unprecedented complexity', Microsoft says | Science, Climate & Tech News | Sky News Skip to content Sky News - back to home Watch Live Home UK Politics World US Money Science, Climate & Tech Ents & Arts Programmes New, Puzzles Videos Analysis Data & Forensics Offbeat Weather More Home UK Politics World US Money Science, Climate & Tech Ents & Arts Programmes New, Puzzles Videos Analysis Data & Forensics Offbeat Weather Hacking by criminals and spies has reached 'unprecedented complexity', Microsoft says The US-based tech company is launching 11 AI cybersecurity \"agents\" tasked with identifying and sifting through suspicious emails, blocking hacking attempts and gathering intelligence on where attacks may originate. Tom Clarke Science and technology editor @t0mclark3 Monday 24 March 2025 16:36, UK Please use Chrome browser for a more accessible video player 1:14 'We are facing unprecedented complexity when it comes to the threat landscape,' says Microsoft's Vasu Jakkal. Why you can trust Sky News A surge in hacking attempts by criminals, fraudsters and spy agencies has reached a level of \"unprecedented complexity\" that only artificial intelligence will be able to combat, according to Microsoft.\"Last year we tracked 30 billion phishing emails,\" says Vasu Jakkal, vice president of security at the US-based tech giant. \"There's no way any human can keep up with the volume.\"In response, the company is launching 11 AI cybersecurity \"agents\" tasked with identifying and sifting through suspicious emails, blocking hacking attempts and gathering intelligence on where attacks may originate.With around 70% of the world's computers running Windows software and many businesses relying on their cloud computing infrastructure, Microsoft has long been the prime target for hackers. Image: An illustration of how Security Copilot agents work. Pic: Microsoft Unlike an AI assistant that might answer a user's query or book a hair appointment, an AI agent is a computer programme that autonomously interacts with its environment to carry out tasks without direct input from a user.In recent years, there's been a boom in marketplaces on the dark web offering ready-made malware programmes for carrying out phishing attacks, as well as the potential for AI to write new malware code and automate attacks, which has led to what Ms Jakkal describes as a \"gig economy\" for cybercriminals worth $9.2trn (£7.1trn).She says they have seen a five-fold increase in the number of organised hacking groups - whether state-backed or criminal.\"We are facing unprecedented complexity when it comes to the threat landscape,\" says Ms Jakkal. The AI agents, some created by Microsoft, and others made by external partners, will be incorporated into Microsoft's portfolio of AI tools called Copilot and will primarily serve their customers' IT and cybersecurity teams rather than individual Windows users.Because an AI can spot patterns in data and screen inboxes for dodgy-looking emails far faster than a human IT manager, specialist cybersecurity firms and now Microsoft have been launching \"agentic\" AI models to keep increasingly vulnerable users safe online.Read more from Sky News:Trump lashes out over portraitPM says minister for men 'not the answer' Image: Pic: Microsoft But others in the field are deeply concerned about unleashing autonomous AI agents across a user's computer or network.In an interview with Sky News last month, Meredith Whittaker, CEO of messaging app Signal, said: \"Whether you call it an agent, whether you call it a bot, whether you call it something else, it can only know what's in the data it has access to, which means there is a hunger for your private data and there's a real temptation to do privacy invading forms of AI.\" Get Sky News on WhatsApp Follow our channel and never miss an update. Tap here to follow Microsoft says its release of multiple cybersecurity agents ensures each AI has a very defined role, only allowing it access to data that's relevant to its task.It also applies what it calls a \"zero trust framework\" to its AI tools, which requires the company to constantly assess whether agents are playing by the rules they were programmed with.A roll-out of new AI cybersecurity software by a company as dominant as Microsoft will be closely watched. Be the first to get Breaking News Install the Sky News app for free Last July, a tiny error in the software code of an application made cybersecurity firm CrowdStrike instantly crash around 8.5 million computers worldwide running Microsoft Windows, leaving users unable to restart their machines.The incident - described as the largest outage in the history of computing - affected airports, hospitals, rail networks and thousands of businesses including Sky News - some of which took days to recover. Related Topics Artificial IntelligenceMicrosoft Sky News footer YouTube Facebook X TikTok Instagram LinkedIn WhatsApp About Sky News About Us Sky News Profiles Sky News International Sky News Library Sales Site Map Editorial Guidelines Sky News Board Sky News Services Sky News RSS Sky News For Your Phone Sky News Radio Sky Channels Sky Witness Sky Atlantic Sky Arts Sky Cinema Sky Sports More Sky Sites NOW Sky Zero Sky Academy Studios Bigger Picture Sky Group Sky Bet Sky.com Sky News Arabia Advertise With Us Terms & Conditions Privacy & Cookies Privacy Options Accessibility Contact Us © 2025 Sky UK",
        "topics": [
            "hacking criminals",
            "fraudsters spy",
            "organised hacking",
            "spy agencies",
            "complexity microsoft"
        ]
    },
    {
        "title": "microsoft-kiota-http 1.9.3",
        "url": "https://pypi.org/project/microsoft-kiota-http/1.9.3/",
        "content": "microsoft-kiota-http · PyPI Skip to main content Switch to mobile version Warning Some features may not work without JavaScript. Please try enabling it if you encounter problems. Search PyPI Search Help Sponsors Log in Register Menu Help Sponsors Log in Register Search PyPI Search microsoft-kiota-http 1.9.3 pip install microsoft-kiota-http==1.9.3 Copy PIP instructions Latest version Released: Mar 24, 2025 Core abstractions for kiota generated libraries in Python Navigation Project description Release history Download files Verified details These details have been verified by PyPI Maintainers microsoft msgraphsdkteam Unverified details These details have not been verified by PyPI Project links Homepage Documentation Repository Meta License: MIT License (MIT) Author: Microsoft Tags kiota, openAPI, Microsoft, Graph Requires: Python <4.0, >=3.9 Classifiers Development Status 5 - Production/Stable License OSI Approved :: MIT License Programming Language Python :: 3 Python :: 3.9 Python :: 3.10 Python :: 3.11 Python :: 3.12 Python :: 3.13 Project description Project details Release history Download files Project description Microsoft Kiota HTTP library The Microsoft Kiota HTTP Library is a python HTTP implementation with HTTPX library. A Kiota generated project will need a reference to a http package to to make HTTP requests to an API endpoint. Read more about Kiota here. Using the Microsoft Kiota HTTP library In order to use this library, install the package by running: pip install microsoft-kiota-http Contributing This project welcomes contributions and suggestions. Most contributions require you to agree to a Contributor License Agreement (CLA) declaring that you have the right to, and actually do, grant us the rights to use your contribution. For details, visit https://cla.opensource.microsoft.com. When you submit a pull request, a CLA bot will automatically determine whether you need to provide a CLA and decorate the PR appropriately (e.g., status check, comment). Simply follow the instructions provided by the bot. You will only need to do this once across all repos using our CLA. This project has adopted the Microsoft Open Source Code of Conduct. For more information see the Code of Conduct FAQ or contact opencode@microsoft.com with any additional questions or comments. Trademarks This project may contain trademarks or logos for projects, products, or services. Authorized use of Microsoft trademarks or logos is subject to and must follow Microsoft's Trademark & Brand Guidelines. Use of Microsoft trademarks or logos in modified versions of this project must not cause confusion or imply Microsoft sponsorship. Any use of third-party trademarks or logos are subject to those third-party's policies. Project details Verified details These details have been verified by PyPI Maintainers microsoft msgraphsdkteam Unverified details These details have not been verified by PyPI Project links Homepage Documentation Repository Meta License: MIT License (MIT) Author: Microsoft Tags kiota, openAPI, Microsoft, Graph Requires: Python <4.0, >=3.9 Classifiers Development Status 5 - Production/Stable License OSI Approved :: MIT License Programming Language Python :: 3 Python :: 3.9 Python :: 3.10 Python :: 3.11 Python :: 3.12 Python :: 3.13 Release history Release notifications | RSS feed This version 1.9.3 Mar 24, 2025 1.9.2 Feb 6, 2025 1.9.1 Jan 29, 2025 1.9.0 Jan 20, 2025 1.8.0 Jan 17, 2025 1.7.1 Jan 15, 2025 1.7.0 Jan 13, 2025 1.6.8 Jan 2, 2025 1.6.7 Dec 17, 2024 1.6.6 Dec 5, 2024 1.6.5 Dec 5, 2024 1.6.4 Dec 4, 2024 1.6.3 Dec 2, 2024 1.6.2 Nov 11, 2024 1.6.1 Nov 9, 2024 1.6.0 Oct 28, 2024 1.5.0 Oct 22, 2024 1.4.6 Oct 18, 2024 1.4.5 Oct 16, 2024 1.4.4 Oct 16, 2024 1.3.4 Oct 11, 2024 1.3.3 Aug 12, 2024 1.3.2 Jul 9, 2024 1.3.1 Mar 1, 2024 1.3.0 Feb 8, 2024 1.2.1 Jan 22, 2024 1.2.0 Nov 30, 2023 1.1.0 Nov 29, 2023 1.0.0 Oct 31, 2023 0.6.3 Oct 25, 2023 0.6.2 Oct 19, 2023 0.6.1 Sep 19, 2023 0.6.0 Sep 13, 2023 0.5.0 Aug 7, 2023 0.4.4 Jun 20, 2023 0.4.3 May 16, 2023 0.4.2 May 9, 2023 0.4.1 Mar 30, 2023 0.4.0 Feb 6, 2023 0.3.1 Jan 24, 2023 0.3.0 Jan 20, 2023 0.2.3 Dec 1, 2022 0.2.2 Nov 28, 2022 0.2.1 Nov 23, 2022 0.2.0 Nov 2, 2022 0.1.2 Oct 27, 2022 0.1.1 Oct 25, 2022 0.1.0 Sep 9, 2022 Download files Download the file for your platform. If you're not sure which to choose, learn more about installing packages. Source Distribution microsoft_kiota_http-1.9.3.tar.gz (21.2 kB view details) Uploaded Mar 24, 2025 Source Built Distribution microsoft_kiota_http-1.9.3-py3-none-any.whl (31.5 kB view details) Uploaded Mar 24, 2025 Python 3 File details Details for the file microsoft_kiota_http-1.9.3.tar.gz. File metadata Download URL: microsoft_kiota_http-1.9.3.tar.gz Upload date: Mar 24, 2025 Size: 21.2 kB Tags: Source Uploaded using Trusted Publishing? No Uploaded via: poetry/2.1.1 CPython/3.12.9 Linux/6.8.0-1021-azure File hashes Hashes for microsoft_kiota_http-1.9.3.tar.gz Algorithm Hash digest SHA256 e4cda140a362cc304c6ca7495f88b48ae9a4b7d98fa01f5b278e52f3b502ea76 Copy MD5 6c5489aadff990dea3a9afda296ab6cc Copy BLAKE2b-256 d073bc8a49643e2cea65fd12cbe61e52be8f142b69e2be143c67219f52c35a08 Copy See more details on using hashes here. File details Details for the file microsoft_kiota_http-1.9.3-py3-none-any.whl. File metadata Download URL: microsoft_kiota_http-1.9.3-py3-none-any.whl Upload date: Mar 24, 2025 Size: 31.5 kB Tags: Python 3 Uploaded using Trusted Publishing? No Uploaded via: poetry/2.1.1 CPython/3.12.9 Linux/6.8.0-1021-azure File hashes Hashes for microsoft_kiota_http-1.9.3-py3-none-any.whl Algorithm Hash digest SHA256 9a5e2b7a96524b2978e01087f415d810d6bcad7cd866d6d60595ebab2e47c56c Copy MD5 048f51d7c016d1111d887df8de03a504 Copy BLAKE2b-256 cff4ef67b7e6dea7d77930df41f4a5926bbba2e362c28a46615908f2d00cf146 Copy See more details on using hashes here. Help Installing packages Uploading packages User guide Project name retention FAQs About PyPI PyPI Blog Infrastructure dashboard Statistics Logos & trademarks Our sponsors Contributing to PyPI Bugs and feedback Contribute on GitHub Translate PyPI Sponsor PyPI Development credits Using PyPI Terms of Service Report security issue Code of conduct Privacy Notice Acceptable Use Policy Status: all systems operational Developed and maintained by the Python community, for the Python community. Donate today! \"PyPI\", \"Python Package Index\", and the blocks logos are registered trademarks of the Python Software Foundation. © 2025 Python Software Foundation Site map Switch to desktop version English español français 日本語 português (Brasil) українська Ελληνικά Deutsch 中文 (简体) 中文 (繁體) русский עברית Esperanto 한국어 Supported by AWS Cloud computing and Security Sponsor Datadog Monitoring Fastly CDN Google Download Analytics Pingdom Monitoring Sentry Error logging StatusPage Status page",
        "topics": [
            "microsoft_kiota_http py3",
            "microsoft kiota",
            "microsoft_kiota_http",
            "url microsoft_kiota_http",
            "file microsoft_kiota_http"
        ]
    }
]